{"2020-05-21-borderlands-3-hotfixes-may-21": "Today we will release a hotfix for Borderlands 3, which will be live on all\nplatforms by 12:00 PM PST. This week’s hotfixes change Rare Spawns in the\n[Guns, Love, and Tentacles: The Marriage of Wainwright &\nHammerlock](https://borderlands.com/en-US/gunslovetentacles/) campaign add-on\nand address a reported concern about world drops in [Mayhem\nMode](https://borderlands.com/en-US/news/2020-04-21-borderlands-3-mayhem-mode/). To apply hotfixes, wait at the main menu until you see a sign that\nsays “Hotfixes Applied”! If you are experiencing any issues or want to provide\nfeedback, please submit a ticket to [support.2k.com](https://support.2k.com/).\n\n **The Loot the Universe mini-event ends with this hotfix on May 21 at 9:00 AM\nPT! There will not be another mini-event in-game in preparation for the June 4\npatch.**\n\n  * Changed Rare Spawns in the Guns, Love, and Tentacles campaign add-on to always spawn\n  * Addressed a reported concern that dedicated drops for Wotan were not dropping in Mayhem 4\n\n", "2020-05-14-borderlands-3-hotfixes-may-14": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 12:00 PM PST. In this week’s hotfixes, [Loot the\nUniverse](https://borderlands.com/en-US/news/2020-04-22-borderlands-3-loot-the-universe/) starts on Nekrotafeyo, and we address some community concerns.\nTo apply hotfixes, wait at the main menu until you see a sign that says\n“Hotfixes Applied”! If you are experiencing any issues or want to provide\nfeedback, please submit a ticket to [support.2k.com](https://support.2k.com/).\n\nThe Loot the Universe mini-event is taking place on Nekrotafeyo this week when\nthese hotfixes are live. Loot Nekrotafeyo until May 21 at 9:00 AM PT!\n\n  * Activate the Loot the Universe event on Nekrotafeyo until 9:00 AM PT on May 21!\n  * Addressed a reported concern where Mayhem would occasionally not award cash, Eridium, or XP after death\n  * Addressed a reported concern that the Legendary weapons Storm and Firestorm were sometimes not spawning their elemental orbs when fired\n  * Removed the inaccurate “Anointed Gunner” text from weapons with the non-character-specific elemental critical hit Anointment\n  * Added the Mongol to Thunk and Sloth’s item pool and increased its damage\n  * Changed the dedicated loot pools for [Takedown at the Maliwan Blacksite](https://borderlands.com/en-US/news/2019-11-22-takedown-at-the-maliwan-blacksite/)’s boss and mini-boss, Wotan and the Valkyrie Squad\n  * Increased the chance for more than one Legendary to drop from the dedicated loot pools of the boss and mini-boss in Takedown at the Maliwan Blacksite\n\n _We've thinned out Wotan's dedicated loot pool with today's hotfix. As a\nresult, the Valkyrie Squad now drops the Takedown at the Maliwan Blacksite\nShields exclusively from their dedicated loot pool, while Wotan drops the\nTakedown at the Maliwan Blacksite Weapons from its dedicated loot pool\nexclusively. This does not affect world drops from these enemies. Paired with\nthe change to allow more than a single Legendary to possibly drop at one time,\nplayers should have an easier and more consistent farming experience in this\ncontent._\n\n", "2020-04-16-borderlands-3-hotfixes-apr-16": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 12:00 PM PST. In this week’s hotfixes we have two new mini-\nevents: Mr. Torgue’s Slaughter Onslaught and Making it Rain! To apply\nhotfixes, wait at the main menu until you see a sign that says “Hotfixes\nApplied”! If you are experiencing any issues or want to provide feedback,\nplease submit a ticket to [support.2k.com](https://support.2k.com/).\n\n **Rare Chest Riches and Loot Monster Mayhem mini-events end at 9:00 AM PST\ntoday.**\n\nThe Co-Op Loot Drop event is continuing until April 30!\n\nThis week, we have two new mini-events: **Mr. Torgue’s Slaughter Onslaught**\nand **Making It Rain**! **Mr. Torgue’s Slaughter Onslaught** will increase the\nnumber of dedicated loot drops from Circles of Slaughter bosses. The **Making\nIt Rain** event will increase the in-game currency Cash drops for normal,\nBadass, and Anointed enemies, which will come in handy when you’re fighting\nthe Cartels in this month’s upcoming patch. These events will go live with the\nhotfix today and will end on April 23 at 9:00 AM PT.\n\nThere are no balance adjustments this week. We wanted to take this time to let\nthe dust settle after the balance adjustments that were made over the previous\nweeks and are continuing to monitor and collect feedback based on those\nchanges.\n\n  * Activate Mr. Torgue’s Slaughter Onslaught mini-event until 9:00 AM PT on April 23\n  * Activate Making It Rain mini-event until 9:00 AM PT on April 23\n  * Addressed a reported concern that Phasegrasp was not supported on Nekrotafeyo\n  * Added gameplay tags for impending Mayhem 2.0 release\n\n", "2020-04-09-borderlands-3-hotfixes-apr-9": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 12:00 PM PST. In this week’s hotfixes, Rare Chest Riches returns\nand brings a new mini-event, Loot Monster Mayhem, in addition to buffs for the\nGunner. To apply hotfixes, wait at the main menu until you see a sign that\nsays “Hotfixes Applied”! If you are experiencing any issues or want to provide\nfeedback, please submit a ticket to [support.2k.com](https://support.2k.com/).\n\n **Slot Machine Mania and Trials Take-All mini events end at 9:00 AM PST\ntoday.**\n\nWith this week’s hotfix, we are continuing the Co-Op Loot Drop event with two\nmini-events! **Rare Chest Riches** returns, along with a new mini-event:\n**Loot Monster Mayhem**! The Rare Chest Riches Event increases your chances of\nreceiving Legendary items from Rare Chests. Loot Monster Mayhem increases your\nchance of seeing Loot enemies in the game and increases their chances to drop\nLegendary gear! These events will go live with the hotfix today and will end\non April 16 at 9:00 AM PT.\n\n  * Activate Rare Chest Riches Event until 9:00 AM PT on April 16\n  * Activate Loot Monster Mayhem until 9:00 AM PT on April 16\n\n# ADJUSTMENTS FOR MOZE, THE GUNNER:\n\nAs we mentioned during last week’s hotfix, we are continuing to work on\nimproving the Gunner’s survivability and Iron Bear’s viability in higher\nlevels of Mayhem. This week brings another set of hotfixes to Moze’s skills\nbased on our investigations. The below notes list the numbers as they will be\nchanged on the skill descriptions.\n\n  * Explosive Punctuation: Increased the cooldown rate awarded to 8%\n  * Hammerdown Protocol: Increased the damage output to 600% and reduced the reload time\n  * Click, Click…: Increased damage bonus from 12/24/36% to 20/40/60%\n  * Specialist Bear: Increased the damage from +25% to +60%\n\nIron Bear Weapons\n\n  * Increased the base damage of the Salamander Flame Thrower\n  * Increased Chemical Warfare’s Melt Damage to 125%\n  * Increased the base damage of the Railgun\n  * Reduced Capacitive Armature’s damage reduction from -75% to -30%\n  * Reduced Corrosive Sabot Round’s damage reduction from -50% to -15%\n  * Increased Shockhammer’s Shock Damage to 60% of damage dealt\n\n", "2020-04-02-borderlands-3-hotfixes-apr-2": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 12:00 PM PST. This hotfix begins two new events, Slot Machine\nMania and Trials Take-All, and includes some buffs to the Gunner, weapons\nbalance, and addressing reported community concerns. To apply hotfixes, wait\nat the main menu until you see a sign that says “Hotfixes Applied”! If you are\nexperiencing any issues or want to provide feedback, please submit a ticket to\n[support.2k.com](https://support.2k.com/).\n\n **The Door Busters mini event ends at 9:00 AM PST today.**\n\nWe also are excited to start two new events: Slot Machine Mania and Trials\nTake-All! They’ll go live with the hotfix today!\n\n **Slot Machine Mania** pays out big time! There’s an increased chance to win\nLegendary gear from Slot Machines, and for grenades to spawn (because who\ndoesn’t like a little risk?). There’s still a chance for other loot to drop,\nbut the rate has been reduced so you can win Legendaries (and take damage)!\n\n **Trials Take-All** boosts the rewards awarded during the Proving Ground\nTrials. Bosses will have a 100% chance to drop loot from their pools during\nthe event.\n\n  * Activate Slot Machine Mania mini-event until 9:00 AM PT on April 9\n  * Activate Trials Take-All mini-event until 9:00 AM PT on April 9\n  * Adjusted the Pearl of Ineffable Knowledge Artifact to do +90% damage and updated the item description to show the correct value\n  * Addressed a reported concern that the Siren’s Stone class mod was sometimes increasing damage taken, instead of decreasing damage taken\n\n# Adjustments for Moze, the Gunner:\n\nWe have been taking a closer at Moze the last few weeks. Here at the first set\nof hotfixes based on those investigations, primarily focused on improving her\nsurvivability. We will be further addressing some areas we identified as\ntrouble spots for her in the future.\n\n  * Reduced the cooldown time for Iron Bear\n  * Increased the amount of fuel for Iron Bear\n  * Increased the bonus on “Behind the Iron Curtain” skill\n  * Increased the bonus on “Security Bear” skill\n  * Increased the bonus on “Experimental Munitions” skill\n\n# Weapon Balance:\n\n **Damned**\n\n  * Increased weapon damage\n\n **Hyperion Weapon Shields**\n\n  * Increased the amount of damage weapon shields absorb\n\n **The Lob**\n\n  * Increased Fire Rate\n  * Reduced projectiles from 3 to 1\n\n **Tiggs Boom**\n\n  * Increased weapon damage\n  * Increased damage from the Starfall meteors\n\n **Moonfire**\n\n  * Increased weapon damage\n  * Increased Critical Damage Bonus\n\n **Good Juju**\n\n  * Non-critical hits now increase Critical Damage Bonus by 20%. This bonus stacks 25 times and is removed upon manual reload.\n\n", "2020-03-26-borderlands-3-patch-hotfixes-mar-26": "Today we will release an update for [Borderlands\n3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition),\nwhich will be live on all platforms (with the exception of Mac, which is\nscheduled for April 2) by 12:00 PM PST, that adds support for the new campaign\nadd-on [Guns, Love, and Tentacles: The Marriage of Wainwright &\nHammerlock](https://borderlands.com/en-US/gunslovetentacles/), [new ECHOcast\nMoxxtail Events](https://borderlands.com/en-US/news/2020-03-24-moxxtail-events-borderlands-3-echocast-extension/), unlocks a new Max Level and\nGuardian Ranks, and addresses some community concerns!\n\nIf you are experiencing any issues or want to provide feedback, please submit\na ticket to [support.2k.com](https://support.2k.com/). Below are the notes for\ntoday’s patch.\n\n#  **Patch Notes**\n\n## New Content:\n\n  * Added support for Borderlands 3 campaign add-on: Guns, Love, and Tentacles: The Marriage of Wainwright & Hammerlock\n  * Level Cap increase - New Max Level 57\n\n _Here it is! Two capstones, everyone! We’re excited to see what interesting\nnew builds everyone creates with these additional skill points!_\n\n  * 3 New Guardian Rank skills and Guardian Rank Increase\n\n _Here are the first 3 new Guardian Rank Perks! In the Enforcer tree we’ve\nadded “C’mon and Slam,” allowing you to use the slam at any height. This\nshould make slam gear a lot more interesting. For the Survivor Tree, you can\nnow enable “Too Angry to Die,” allowing any damage you do to enemies in Fight\nFor Your Life to slightly extend your down time. Finally, in the Hunter tree\nwe added “Harmageddon,” where additional damage is done to enemies that have\nreceived multiple static effects._\n\n  * New campaign add-on Game Menus that will allow players to start the campaign add-on with an auto-leveled character\n\n _You can now immediately jump into new DLC content right from the menu!\nYou’ll start the game with a character leveled up to where the DLC content\nwould be unlocked, and you can start right in the new content._\n\n  * Support for the ECHOcast update and new Moxxtail Events\n\n _Viewers can show their appreciation for their favorite streamers with\nMoxxtail Events, which let you convert Twitch Bits into in-game beverages that\nprovide the streamer with various limited-time buffs. We have a full\nexplanation of how they work in our_[ _Moxxtail Events\nguide_](https://borderlands.com/en-US/news/2020-03-24-moxxtail-events-borderlands-3-echocast-extension/) _, so be sure to check that out if you want\nto dabble in some Borderlands 3 mixology._\n\n## Stability\n\n  * Addressed memory leaks that occasionally occurred on Split Screen join/leave\n  * Fixed a crash that could sometimes occur after spending a large amount of Guardian Tokens\n  * Fixed a crash that could sometimes occur when quickly navigating Crazy Earl’s shop\n  * Fixed a crash that could sometimes occur during the objective to collect tokens in the “Kill KillaVolt” mission in Lectra City\n  * Fixed a crash that could sometimes occur during the “Melee Mine Cart” objective of Angels and Speed Demons in Konrad’s Hold\n  * Fixed a crash that sometimes occurred when loading into Grand Opening in [Moxxi’s Heist of The Handsome Jackpot](https://borderlands.com/en-US/handsomejackpot/)\n  * Fixed a crash that could sometimes occur when transitioning from The Spendopticon to The Compactor in a four-player game in Moxxi’s Heist of The Handsome Jackpot\n\n## Performance\n\n  * Optimization improvements\n  * UI Optimizations\n\n## General\n\n  * Gear lower than level cap no longer drops when player and enemy characters are each at level cap\n\n _We saw the community feedback here and agreed that seeing gear below the\nlevel cap, when at the level cap, was not an ideal experience. Characters at\nmax level should no longer receive gear at a level lower than their character\nthrough chests and drops from enemies that are also at the level cap._\n\n  * Added the ability start a campaign add-on with an auto leveled character\n  * Added support for more Guardian Rank perks\n  * Re-balanced game stage regions starting from about Act 2 on to better follow the player growth\n\n _Based on data and community feedback, we have adjusted the leveling\nexperience post-Act 2 to better ensure that enemies are properly leveled to\nplayers as they move into the second half of the game. This change will only\nimpact characters created after this patch is live._\n\n  * Addressed a reported concern that Anointed enemies would not always encase themselves in Eridium when dying\n  * Removed the status effects from Anointed enemies after they crystallize to prevent players from taking damage when shattering the crystal\n  * Addressed a reported concern that the beam attack from Graveward’s head would occasionally only do a little bit of damage\n  * Addressed a reported concern that enemies would sometimes not play their physical death actions if interrupted by animation actions\n  * Addressed an issue where The Mystery Cube in Desolation’s Edge would sometimes no longer respawn when reloading the map\n  * Addressed a reported concern that Pappy and Pappy’s Jalopy would sometimes re-spawn when quitting the game after dying with Pappy’s Jalopy during “The Feeble and the Furious” mission in Devil’s Razor\n  * Addressed a reported concern where Tediore weapons with the sticky part modifier would sometimes disappear abruptly when bounced off of an interactive object\n  * Fixed an issue where the Bangarang XL bullet VFX would sometimes remain on the host’s screen when thrown\n  * Changed the visuals when looking through the glass bottle scope of some COV Assault Rifles\n  * Shields that trigger effects while depleted, like Brawler Ward, can no longer be trigger multiple times while the game is paused\n  * Shields that trigger effects while full, like Commuter Re-Charger, can no longer be stacked when taking enough damage to deplete it in one hit\n  * Shields that project a shield while crouching will now properly destroy the projected shield when the shield is removed while active\n  * Addressed a reported concern that the Phasezerker class mod sometimes displayed temp text when rolled with 2 points in Conflux, 2 points in Clarity and 1 point in Anima\n  * Addressed a reported concern where players could sometimes see maps the host had not discovered yet when playing multiplayer\n  * Addressed a reported concern that mission-specific weapons could occasionally spawn at the host’s level instead of the player in TVHM during multiplayer\n  * Addressed a reported concern that mission rewards would sometimes spawn at the host’s level instead of the player’s level in TVHM\n  * Added four specific dialog lines that can be played from the Main Menu, one for each character class\n  * Addressed a reported concern that incorrect subtitles would sometimes play when loading into maps after starting a new game\n  * Addressed a reported concern that mission weapons like Rogue-Sight could be mounted on the wall in the Players Quarters\n  * Addressed a reported concern where the Fast Travel Stations of the Zone challenge progress would sometimes not update properly after fast travelling to the Fast Travel in Meridian Outskirts\n  * Addressed a reported concern that the total number of Eridian Writings were sometimes displaying incorrectly\n  * Fixed an issue with duplicate loc text was sometimes not getting translated\n  * Fixed an issue where Eridium Jars would sometimes not replicate properly\n  * Addressed a reported concern where VoG from Tannis could appear improperly in certain situations\n  * Addressed a reported concern where VoG from Lilith could appear improperly in certain situations\n  * Addressed a reported where VoG from Lilith could sometimes appear white after she loses her powers\n  * Addressed a reported concern where the Galaxy Map would occasionally appear in the Minimap when closing the ECHO device\n  * Addressed a reported concern that players were sometimes not seeing Cryo status effects after entering FFYL with the Cryo effect active\n  * Addressed a reported concern that weapon skins would appear to revert to the default skin after opening the inventory again\n  * Addressed a reported concern that players could occasionally get stuck in character select when joining a host that is viewing the opening cinematic\n  * [Console Only] Added a limited pause menu for the primary player during splitscreen when the second player joins late in the intro cinematic\n  * [Console Only] Addressed an issue where two sets of subtitles would sometimes appear on-screen during cinematics in split-screen\n  * [Console Only] Addressed a reported concern with black lines sometimes appearing along the sides and bottom of the viewport on consoles\n  * [Console Only] Addressed a reported concern that the load character menu would sometimes fail to read save games for a splitscreen player if the controller was disconnected before they were added (which would cause the menu to spin for a long time)\n  * Nativized micropatches (older hotfixes are now in the game permanently)\n\n## Characters\n\n  * Addressed a reported concern that the Siren’s “Find Your Center” skill does not grant a melee attack speed bonus to clients\n  * Addressed a reported concern that the Siren’s “Phasegrasp” skill may not function if the player fires a Jakobs pistol immediately after triggering the skill\n  * Addressed a reported concern that the Beastmaster’s pet’s gun would appear to float during cinematic scenes\n  * Addressed a reported concern that the Gunner’s “Stainless Steel Bear” skill would increase the fuel gauge but not award additional fuel\n  * Addressed a reported concern that the Beastmaster’s “Rakk Attack” skill would not gain a charge after getting a critical hit with the “Head Count” skill active\n\n## FX\n\n  * Addressed a concern that the explosive base material would sometimes not render correctly\n  * Addressed a concern that the blue simulation FX from the missions “Head Case” or “Transaction-Packed” would sometimes remain on the screen when entering the Calibrate Display options menu\n  * Switched the sword slash material in Zer0’s title card with the correct one\n  * Addressed a concern that split-screen players would sometimes not see Zane’s melee FX in third person\n\n## UI\n\n  * Addressed a reported concern that the notification slide did not appear properly when taking a photo in the Inspect menu\n  * Addressed a reported concern that the Inner Dead Zone setting sometimes did not apply when viewing items in the inspection menu\n  * Addressed a reported concern that ECHO menu backdrop particles would sometimes appear during cinematic cutscenes if the ECHO menu was open before the cutscene started\n  * Addressed a reported concern that the 3D character model in the menu would sometimes persist in the world if the player paused while switching from the Skills to the Inventory menu\n  * Addressed a reported concern that the HDR calibration menu would sometimes become stuck on the screen if players accepted an invite while the menu was open\n  * Addressed a reported concern that details for a nearby player would sometimes be displayed when trying to select a fast travel station in the ECHO Zone Map\n  * Addressed a reported concern that some players were sometimes unable to select a custom waypoint when using Cycle Waypoint in the ECHO Zone Map\n  * Addressed a reported concern that a waypoint in the ECHO Zone Map was sometimes not displayed, and had no text, after the player quit and rejoined before taking the Eridium Fabricator from Typhon in the “Footsteps of Giants” mission in Desolation’s Edge\n  * Addressed a reported concern that some players could sometimes lose functionality when opening the pause menu immediately before a cinematic played\n  * Addressed a reported concern that waypoints for all in-progress missions would could sometimes display on the ECHO Zone map\n  * Addressed a reported concern that the minimap would sometimes not be scaled properly after adjusting the graphics preference in the Visuals options menu\n  * Addressed a reported concern that the minimap would occasionally not display properly during multiplayer\n  * Addressed a reported concern when opening the map when a cutscene had been triggered\n  * Removed the current/max counts from the Unlocked Decorations menu\n  * Mission delivery menu is now properly closed when walking out of range of the mission giver\n  * Addressed a reported concern that an inspected item would sometimes spawn before the menu finished loading causing the inspect item to clip into the camera\n  * Addressed a reported concern that sometimes caused the warning icon and alarm to continuously play after dying from driving a vehicle into a boundary turret\n  * Addressed a reported concern where the Disable/Enable perk button text for Guardian Rank would sometimes not update properly when enabling or disabling a Guardian Rank perk for clients\n  * Addressed a reported concern where players were sometimes able to “disable” the skin and weapon unlocks slots in the Guardian Rank menu\n  * Addressed a reported concern that some mission objectives were sometimes showing up on the map when they should not\n  * Addressed a reported concern that mission waypoints associated with multiple missions could sometimes erroneously become active\n  * Addressed a reported concern where the client’s UI would sometimes not update when the Gunner’s “Salamander Thrower” element was changed\n  * Addressed a reported concern that player portraits were sometimes not loading properly when joining in as a secondary split screen user\n  * Addressed a reported concern that the player portraits were sometimes not displaying correctly after a client would quit to the main menu from the character select screen\n\n## Missions\n\n  * Mission experience and mission rewards now support level sync\n  * Addressed a concern that Claptrap would sometimes continue his chatter about being released from the magnet after already being released\n  * Addressed a reported blocker that could sometimes occur when the objective “Collect succulent skag meat” does not appear during the “Skag Dog Days” mission in The Droughts\n  * Addressed a reported blocker that could sometimes occur when the objective “Give batteries to Moxxi” does not complete during the “Kill Killavolt” mission\n  * Addressed a reported concern that the mission tracker was sometimes not present after fast travelling back to Sanctuary immediately after finishing the “Hostile Takeover” mission\n  * Addressed a reported concern that a waypoint was sometimes missing during the objective “Return to Maya” in the “Beneath the Meridian” mission in Vault of the Rampager\n  * Addressed a reported concern that a waypoint was sometimes missing when quitting during the “Kill grogs” objective of the “Swamp Bro” mission in Floodmoor Basin\n  * Addressed a reported blocker that could sometimes occur when quitting after collecting the Vault Key fragment during “The Family Jewel” mission in Voracious Canopy\n  * Unlocked jet booster and monster wheel parts for the Technical when completing missions “Blood Drive” and “Angels and Speed Demons”, respectively. This fix is not retroactive, and an upcoming change will patch save games that have previously completed these missions to ensure that the character has unlocked these parts.\n  * Addressed a reported concern that a waypoint was sometimes missing for the “Kill Rakkman” mission\n  * Addressed a reported blocker that could sometimes occur when the user is able to reach and kill Mouthpiece early during the “Pandora’s Next Top Mouthpiece” mission\n  * Addressed multiple reported concerns that could sometimes occur when returning to Sanctuary immediately after taking the Eridium Fabricator from Typhon during the “Footsteps of Giants” mission\n  * Addressed a reported blocker that could sometimes occur if the player stood in front of Tannis during the “In the Shadow of Starlight” mission\n\n## ECHOcast\n\n  * Reworded the Rare Chest Beginning Event message to remind the streamer not to exit the level before the event completes\n  * Added a status menu section for ECHOcast\n  * Added DPS and number of Legendaries spawned to streaming stats\n  * Added a streaming tab in the Social menu\n\n#  **Hotfix Notes**\n\n  * Addressed a reported crash in Slaughterstar 3000 that could occasionally occur when dying and respawning.\n\n **Hotfixes for Guns, Love, and Tentacles**\n\nIn order to prevent confusion when players load up Guns, Love, and Tentacles,\nwe’ve identified some potential issues and have been able to pre-emptively put\nout hotfixes related to them. Make sure that your hotfixes are applied to\nbenefit from the weapon buffs and to prevent the following from occurring.\nCheck that the “Hotfixes Applied” sign at the main menu is active before\nloading into the game.\n\n  * Addressed a concern that creating a new game to skip to the add-on content would grant the players class mods they were unable to equip\n\n# Guns, Love, and Tentacles Weapon Adjustments:\n\n **Soulrender**\n\n  * Reduced the chance to spawn Skulls\n  * Increased Soul Render Damage\n\n **Anarchy**\n\n  * Corrected the Item Description and Red Text to show in the correct area\n\n **Oldridian**\n\n  * Increased Weapon Damage\n\n **SF Force**\n\n  * Increased Weapon Damage\n\n **Serryul Killur**\n\n  * Increased Weapon Damage\n\n", "2020-03-19-borderlands-3-hotfixes-mar-19": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 12:00 PM PST. This hotfix addresses concerns reported by the\ncommunity. To apply hotfixes, wait at the main menu until you see a sign that\nsays “Hotfixes Applied”! If you are experiencing any issues or want to provide\nfeedback, please submit a ticket to [support.2k.com](https://support.2k.com/).\n\n  * Addressed a potential progression blocker from Typhon during “In the Shadow of Starlight”\n  * Addressed a reported concern that the Siren’s Fist Over Matter skill was sometimes not working as intended if it was not in the hosts’ view\n  * Adjusted the collision at the stairs in Quietus Pike to prevent players from sometimes sinking into the ground after destroying the second vine door\n  * Changed the Operative’s Cool Hand skill description to show the correct values\n  * Addressed a reported concern that Tyreen would occasionally re-appear after the cutscene during “The Great Vault\n\n", "2020-03-12-borderlands-3-epic-patch-mar-13": "Tomorrow we will release an update for [Borderlands\n3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) on\nPC for Epic, which will be live by 12:00 PM PST on March 13! This patch adds\nPC Cross-Play functionality through Gearbox Software SHiFT, new matchmaking\nmenus, and addresses a reported concern with scrolling in Vending Machines.\n\nIf you are experiencing any issues with this patch, or want to provide\nfeedback, please submit a ticket to [support.2k.com](https://support.2k.com/).\n\nThe first time players launch Borderlands 3 after the update through Epic or\nSteam, they will be asked to choose a Gearbox Software SHiFT Display Name.\nThis name is displayed in-game when playing with other players. You can change\nyour display name at any point in the Account Details tab of the Social Menu.\n\n  * Added backend functionality for Gearbox Software SHiFT Matchmaking so players can play with both Epic and Steam users\n  * Added functionality to use the player’s SHiFT Display Name to find and join friends playing on PC regardless of platform\n\n# Menu Changes\n\n  * Added two new buttons to the Roster Tab of the Social Menu\n\n\\- “Find SHiFT Friend” allows you to enter the exact SHiFT Display Name you’re\nlooking for to add as a friend or block  \n\\- “Manage SHiFT Friends” allows you to view all current SHiFT friends and\ngame invitations  \n\\- All friends will have an icon to indicate if they are a friend through\nGearbox Software SHiFT or your PC platform (Epic or Steam)\n\n  * Added additional pages to the SHiFT tab of the Social Menu\n\n\\- Redesigned the SHiFT Code and Reward History tabs  \n\\- Added a new Account Details tab to allow players to update their SHiFT\nDisplay Name (this will also update the player’s display name on\nforums.gearboxsoftware.com and on the Gearbox Software SHiFT website)\n\n  * Network & Social in the Options Menu now includes control options for PC Cross-Play functionality\n\n\\- Added “Friend Sync” toggle to give players the option to sync friends from\nEpic and Steam to Gearbox Software SHiFT  \n\\- Added “PC Cross-Play” toggle to give players the option to be included in\nPC Cross-Play matchmaking pools (when toggled to “Off”, players will only be\npaired with other players on their current PC platform)\n\n _Note: Currently, players are still only able to send mail to players on the\nsame platform. This will be changed in a future patch._\n\n# Additional Fixes\n\n  * Addressed a reported concern that scrolling functionality was sometimes not available in Vending Machines and item cards were sometimes not staying on the screen\n  * Added functionality when signing into SHiFT for “Forgot your Password?” to link to a new page\n\n", "2020-03-12-borderlands-3-hotfixes-mar-12": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) which will be live on all\nplatforms. This hotfix addresses concerns reported by the community and\nadjusts various locations where enemies were sometimes spawning under-leveled.\nTo apply hotfixes, wait at the main menu until you see a sign that says\n“Hotfixes Applied”! If you are experiencing any issues or want to provide\nfeedback, please submit a ticket to [support.2k.com](https://support.2k.com/).\n\n# General\n\n  * Addressed a reported concern that was causing Typhon to sometimes be a potential blocker in “Shadow of Starlight”\n  * Addressed a reported concern that the Jabbermogwai was sometimes not dropping loot at the correct rate\n\n# Characters\n\nWe’re looking to go over each of the Vault Hunters to identify any\ninconsistencies in gameplay. Some of these concerns will have to be addressed\nvia patches, but for issues such as incorrect values being listed, we’re able\nto adjust in hotfixes.\n\n  * Removed the Gunner’s “General Winter” minigun damage penalty and Cryo penalty.\n  * Adjusted the Gunner’s “Exploding. Bullets.” skill to match the current damage output, which was sometimes higher than stated on the skill description\n  * Addressed an issue with the Beastmaster’s “Furious Attack” skill where it was sometimes rounding its values and making the skill description and damage output appear inconsistent\n  * Addressed an issue with the Beastmaster’s “Hunter’s Eye” skill where the skill description was sometimes showing values from incorrect fields\n\n# Location Re-Balancing\n\nThis adjustment will only affect new characters as we continue to improve and\nbalance progression. We’ll first implement this change on Friday, March 13 for\nPC players on Steam and Epic; players on all other platforms (PlayStation®4,\nXbox One, Stadia, and Mac) will receive these improvements in a patch coming\nlater this month.\n\nWe found that new players were consistently entering certain areas over-\nleveled for the content they were playing. This occasionally trivialized those\nareas, as enemies were sometimes much weaker than intended for that point in\nthe game. We also found that some side missions later in the game were largely\nignored because of these balance irregularities. These balance changes bring\nthe enemies up to the average level that we see players hitting in these\nlocations.\n\n  * Various areas and side missions on [Nekrotafeyo](https://borderlands.com/en-US/planets/nekrotafeyo/) should now match the average level of players\n  * Enemies in The Anvil should now match the average level of players\n\n# Weapons\n\n **Sickle**\n\n  * Addressed a reported concern that the “Boom” prefix was sometimes not receiving the buff from last week’s hotfix\n\n **Boomer**\n\n  * Increased weapon damage\n\n **The Garcia**\n\n  * Increased the Fire Rate\n  * Increased the number of projectiles shot\n\n **Hellfire**\n\n  * Increased weapon damage\n  * Increased the Damage Over Time amount\n\n **Hyperfocus XZ41**\n\n  * Increased weapon damage\n\n **Linc**\n\n  * Increased weapon damage\n\n **Nemesis**\n\n  * Increased weapon damage\n\n **Nimble Jack**\n\n  * Increased weapon damage\n  * Added 100% Bonus Critical Damage\n\n **Ogre**\n\n  * Increased weapon damage\n\n **One Pump Chump**\n\n  * Increased weapon damage\n\n **Roisen’s Thorns**\n\n  * Increased weapon damage\n\n **Sawbar**\n\n  * Increased weapon damage\n  * Adjusted the timing of when the three projectiles split to be sooner\n\n **SkekSil**\n\n  * Increased the Extra Projectile Damage\n\n **Tankman’s Shield**\n\n  * Increased the Maximum Damage Cap by 200%\n  * Increased the percent damage awarded per kill\n\n", "2020-03-05-borderlands-3-hotfixes-mar-5": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 12:00 PM PST. This hotfix addresses concerns reported by the\ncommunity and makes buffs to various Legendaries. To apply hotfixes, wait at\nthe main menu until you see a sign that says “Hotfixes Applied”! If you are\nexperiencing any issues or want to provide feedback, please submit a ticket to\n[support.2k.com](https://support.2k.com/).\n\n  * Addressed a reported concern that Moist Hand Luke and Grabby Gretchen would occasionally spawn inside of the wall during “Playing with Fire”\n  * Addressed a reported concern that Eridium jars in Atlas HQ were occasionally despawning when leaving the area\n  * Addressed a reported concern where characters could sometimes get stuck between a bush and the railing in The Spendopticon\n  * Addressed a reported concern where characters could sometimes get stuck between a Ratch nest and a tree near the beginning of the Market District\n  * Addressed a reported concern that players were sometimes able to escape the boss arena during the Trial of Cunning\n  * Addressed a reported concern that the “Like, Follow, Obey” skin was sometimes displaying corrupt textures on the Gunner\n\n# Vault Hunters:\n\nThis week, we took a look at some character skills that were occasionally not\nproperly reporting what was happening in-game. For these instances, we have\nupdated the description text to show the actual in-game values and removed an\ninstance of a penalty that was not reported on its skill description.\n\n  * Addressed reported instances of the Gunner’s skill descriptions sometimes showing inaccurate values\n\n\\- “Hell on Rails” skill description was occasionally showing +30% Fuel Drain\ninstead of the actual +8%  \n\\- “Corrosive Sabot Round” skill description was occasionally showing -50%\nRailgun Damage and Fuel Drain instead of the actual -33%\n\n  * Addressed a reported concern that the Gunner’s “Active Tracking” skill was receiving a 50% penalty to damage per missile and ammo capacity that was not listed in the skill description. We have removed this penalty\n  * Fixed a typo with the Beastmaster’s “Furious Attack” skill in English\n  * Addressed a reported concern that Blood Cooled Jackbot’s beam attacks were bypassing the Operative’s barrier\n\n# Weapons:\n\nWe are also looking at some of our Legendary weapons to get them up to par as\npart of the impending release of Mayhem 2.0, one of the [Spring 2020 content\nadditions we discussed at PAX East](https://borderlands.com/en-US/news/2020-02-27-borderlands-3-pax-east-dlc-2-steam-spring2020roadmap/).\n\n **Crader’s EM-P5**\n\n  * Increased Critical Damage by 80% while airborne\n\n **Faisor**\n\n  * Increased amount of shotgun projectiles from 6 to 8\n  * Increased the reload time of the under-barrel shotgun (rate at which the under-barrel shotgun refills ammo)\n  * Increased weapon damage on both firing modes\n\n **Firestorm**\n\n  * Increased weapon damage\n\n **Hellshock**\n\n  * Increased number of projectiles per shot to 2\n  * Increased weapon damage\n\n **Krakatoa**\n\n  * Increased weapon damage\n\n **Nine-Volt**\n\n  * Increased weapon damage\n\n **Sickle**\n\n  * Increased fire rate\n  * Increased weapon damage\n\n **Smart-Gun**\n\n  * Increased weapon damage and the damage on the thrown projectile\n\n **Storm**\n\n  * Increased weapon damage\n\n **Thunderball Fist**\n\n  * Increased damage on the Initial Shot and the Thunderball\n\n", "2020-02-27-borderlands-3-hotfixes-feb-27": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 12:00 PM PST. This hotfix addresses concerns reported by the\ncommunity. To apply hotfixes, wait at the main menu until you see a sign that\nsays “Hotfixes Applied”! If you are experiencing any issues or want to provide\nfeedback, please submit a ticket to [support.2k.com](https://support.2k.com/).\n\n  * Addressed a reported concern that players were sometimes able to bypass Trudy’s spawn trigger during “Kill KillaVolt”\n  * Addressed a perceived progression blocker during “All Bets Off” where enemies that were dropped in from a drop pod would sometimes not appear when the player left and returned to the area\n  * Included a stopgap fix to prevent a reported blocker due to enemies sometimes becoming stuck in unreachable locations in Cistern of Slaughter\n\n _This will be addressed further in a future patch, along with a change to\nBrood Mother’s spawn conditions._\n\n  * Addressed a reported concern that the “Should’ve Cashed Out” challenge was sometimes not progressing when killing Looters in the DLC area\n  * Adjusted Billy the Anointed’s behaviors so that they would not teleport as often during a fight, and increased the chance for them to drop Lead Sprinkler\n  * Addressed a reported concern that players could sometimes get stuck on top of a row of slot machines inside the second VIP room at Beggar’s Berth\n\n# Weapons\n\n **DAHL**\n\n  * Increased damage of all DAHL Assault Rifles by 35%\n\n **The Lob**\n\n  * Increased Magazine Size from 4 to 12\n  * Greatly increased damage per tick\n  * Now fires a burst shot of 3 magical orbs instead of 1\n\n **Woodblocker**\n\n  * Increased Critical Hit Damage by 100%\n  * Slightly reduced Vertical Recoil\n\n **Malak’s Bane**\n\n  * Greatly increased damage\n  * Reduced shotgun ammo cost from 4 to 2\n\n **Ruby’s Wrath**\n\n  * Greatly increased damage\n  * Greatly reduced the Cooldown of Singularity Grenade\n\n", "2020-02-20-borderlands-3-hotfixes-feb-20": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 12:00 PM PST. This hotfix addresses concerns reported by the\ncommunity. To apply hotfixes, wait at the main menu until you see a sign that\nsays “Hotfixes Applied”! If you are experiencing any issues or want to provide\nfeedback, please submit a ticket to [support.2k.com](https://support.2k.com/).\n\n  * Addressed a potential exploit where players were sometimes able to open the Rare Chest in Slaughterstar 3000 when entering Iron Bear’s turret\n  * Addressed a reported concern that Oversphere enemies occasionally would not shoot with their optic lasers in True Vault Hunter Mode or Mayhem Mode\n  * Addressed a reported concern that placeholder swords were sometimes visible in Athenas\n  * Addressed a reported concern that the Fabricator was sometimes letting loot drop outside of the map\n  * Adjusted the balance for Tony Bordel and Petunia in Mayhem Mode\n\n", "2020-02-13-borderlands-3-patch-hotfixes-feb-13": "Today we will release an update for [Borderlands\n3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition),\nwhich will be live on all platforms today by 3:00 PM PST, that addresses\nmultiple community requests such as skippable cutscenes, Guardian Rank\ntoggles, a level cap increase, and kicks off the week-long [Broken Hearts Day\nEvent](https://borderlands.com/en-US/news/2020-02-11-broken-hearts-day-event/)!\n\nHotfixes are applied at the main menu. To apply hotfixes, wait at the main\nmenu until you see a sign appear. If you are experiencing any issues or want\nto provide feedback, please submit a ticket to\n[support.2k.com](https://support.2k.com/). Below are the notes for today’s\npatch and hotfixes.\n\n#  **PATCH NOTES**\n\n### Broken Hearts Day Event\n\nMaurice, your sentient Saurian shipmate on Sanctuary III, is continuing his\nstudy of humanity’s customs, and has taken an interest in our strange courting\nrituals. To help him understand the emotional rollercoaster that is Broken\nHearts Day, you’ll need to blast the floating hearts that are popping up over\nbaddies’ heads all over the galaxy. Maurice will reward you with sweet Broken\nHearts Day loot for your trouble, **including two level 53 weapons:**\n**Terminal Polyaimorous and Wedding Invitation**!\n\n#### Event Toggle\n\nFor the Vault Hunter who already has everything, or prefers their gameplay to\nbe more straightforward, you can now disable the Broken Hearts Day Event in\nthe main menu. This highly requested feature will be included for all future\nseasonal events as well.\n\n### Skippable Cutscenes\n\nWith this patch, you can now skip all cutscenes in the game, whether you’ve\nseen the cutscene before or not, during solo play or by the host of your party\nduring multiplayer! Simply press any key during the scene and you’ll be\nprompted to confirm the skip.\n\n### Level Cap increased to 53\n\nThe level cap has been increased to 53, providing everyone with 3 more skill\npoints to aim for! We are looking forward to seeing what interesting\ncombinations the community finds with their additional skills and will have\nmore to talk about in the future concerning level cap increases and character\ngrowth.\n\n### True Takedown Mode\n\nWe’re introducing True Takedown Mode to the [Takedown at the Maliwan\nBlacksite](https://borderlands.com/en-US/news/2019-11-22-takedown-at-the-maliwan-blacksite/). As of this patch, there will be a way to re-enable the\noriginal version of the Takedown scaled to 4 players. Future Takedowns will\nalso launch with both modes enabled.\n\nThe default setting keeps the Takedown scaled depending on how many people are\nin your party. To turn back on 4-player scaling, toggle the new switch to the\nright of the Takedown door.\n\n### Guardian Ranks\n\nYou are now able to turn off individual Guardian Ranks or the whole system! If\nthere are any perks that aren’t playing nice with your builds, you can now\ndisable them! Furthermore, for those who want to enjoy a vanilla leveling\nexperience, you have the ability to disable the entire system. This includes\nboth stat bonuses and all perks.\n\n **When the patch goes live, the Guardian Rank system will be turned off by\ndefault,** giving you a great opportunity to look through your perks to see if\nthere’s anything new you want to try! _Note: while the Guardian Rank system is\nturned off, you will not be able to gain ranks._\n\n## Stadia\n\nWith this patch, Stadia is now caught up to the other platforms! Stadia\nplayers can now access [Moxxi’s Heist of The Handsome\nJackpot](https://borderlands.com/en-US/news/2019-11-20-moxxi-s-heist-of-the-handsome-jackpot/), fight through Takedown at the Maliwan Blacksite, and take\nadvantage of the QOL improvements that were included in previous patches.\n\n## Stability\n\n  * Addressed multiple reported crashes\n  * Addressed multiple reported memory crashes\n  * Addressed a reported crash that could sometimes occur when updating the position of the dueling timer during a level transition\n  * Addressed a reported crash that could sometimes occur when there is no player character while spectating in the Takedown at the Maliwan Blacksite\n  * Addressed a rare crash that could sometimes occur when hijacking a vehicle\n  * Addressed a rare crash that could sometimes occur after extended hours of play\n  * Addressed a rare crash that could sometimes occur during combat in Athenas\n  * Addressed a rare crash that could sometimes occur during combat in Atlas HQ\n  * Addressed a rare crash that could sometimes occur in a multiplayer game in The Droughts\n  * Addressed a reported crash that could sometimes occur when loading into a map when Campaign Matchmaking\n  * Addressed a reported crash that could sometimes occur when elements react in bodies of water\n  * Addressed a reported freeze that could sometimes occur during garbage collection\n  * Addressed a reported crash that could sometimes occur when using Iron Bear\n  * Addressed a rare crash that could sometimes occur after respawning a vehicle and then using the CAR station before the vehicle spawns\n  * Addressed a reported crash that could sometimes occur when holding both the left and right arrow keys while on the Skills tab of the ECHO menu on PC\n  * Addressed a rare crash that could sometimes occur when quitting to desktop after another user disconnects during multiplayer on PC\n  * Addressed a reported crash that could sometimes occur when a host selected Quit to Portal on Stadia\n  * Addressed a reported memory leak on map transitions\n\n## Performance\n\nWe are continuing to work on additional stability and performance updates for\nfuture patches.\n\n  * Implemented multiple performance optimizations\n  * Implemented multiple audio performance optimizations\n  * Addressed reported performance issues encountered when players are pushed by another user’s vehicle\n  * Addressed a reported performance issue when fighting enemies at Lumberton Junction in Floodmoor Basin\n  * Addressed reported performance issues when scrolling through Guardian Rank Menu icons quickly\n\n## General\n\n  * Added weight to the Guardian Rank random reward selection to favor reward options with less tokens applied to them\n  * Addressed a reported concern that some missions were not awarding their cosmetic item rewards\n  * Players should now have the following mission rewards if they completed the associated missions:\n\n\\- NOG Mask - Techincal NOGout in Meridian Outskirts  \n\\- Atlas Classic skin - Atlas, At Last  \n\\- Gilded Rage Jakobs skin - Cold as the Grave  \n\\- Signature Style CoV skin - The Great Vault  \n\\- Drop It Weapon Trinket - It’s Alive\n\n  * Addressed a reported concern that players could be granted starting gear that was far beyond their level\n\n  * Addressed a reported concern that a player in spectator mode would occasionally lose functionality when the Takedown host fast traveled to a different map\n  * Addressed a reported concern that a Second Wind would occasionally reset the Takedown mission after players had failed the mission\n  * Addressed a reported concern that players were occasionally respawning at the incorrect checkpoint in Meridian Outskirts\n  * Addressed a reported concern that the player character on the character select menu would be positioned incorrectly when a player late joins a multiplayer game on Skywell-27\n  * Addressed a reported concern that the weapon Tiggs Boom was spawning projectiles in the wrong location\n  * Increased the chance of Tiggs Boom to spawn a projectile\n  * Addressed a reported concern that Anointed Enforcer’s shield would occasionally disappear and make the enemy appear vulnerable when they were not\n  * Addressed a reported concern that third-person healing effects could occasionally scale larger than intended\n  * Addressed a reported concern that players were occasionally being teleported to random places during cutscenes when standing on specific spots in a map\n  * Addressed a reported concern that the incorrect icon was displayed when confirming in Japanese on PlayStation 4\n  * Addressed a reported concern that item cards would occasionally remain present on the screen after picking up an item\n  * Addressed a reported concern that videos could sometimes appear corrupt on Stadia\n  * Addressed a reported concern where certain key inputs would not be accepted properly on Stadia\n  * Addressed a reported concern that the joinable status of a game on Stadia could be inaccurate\n  * Addressed a reported concern with incorrect key glyphs showing when returning to the Main Menu on Stadia\n  * Nativized previous hot fixes\n\n## Missions\n\n  * Addressed a perceived progression blocker after entering Lectra City from another map after completing the “Collect Batteries” objective of “Kill KillaVolt”\n  * Addressed a perceived progression blocker that occasionally occurred during the “Return toppings to Tina” objective of “Hammerlocked”\n  * Addressed a perceived progression blocker that could sometimes occur after leaving and re-entering the map during the “Check dead drop” objective of “Going Rogue”\n  * Addressed a reported concern where dialog could be repeatedly triggered if the player loaded into another map while on the objective “Take alternate path” during “Footsteps of Giants” on Desolation’s Edge\n  * Addressed a perceived progression blocker during the “Loot Vault” objective with Typhon during “Footsteps of Giants”\n  * Addressed a reported concern where a player with active missions could start a session with no tracked mission if their previously tracked mission could not be tracked\n\n#  **Hotfix Notes**\n\n  * Addressed a reported concern that the “Emergency Response” perk was increasing Shield Recharge Delay, rather than decreasing it\n  * Addressed a reported concern that the crowd audio was sometimes coming from a separate location while chasing down Carnivora\n  * Added blockers to prevent players from occasionally escaping the map without dying when jumping off the edge of a cliff in Carnivora\n  * Addressed a reported concern that players could walk through a wall of rocks in Carnivora\n  * Added blockers to prevent players from escaping the map near the Apollyon Transit Station New-U in Neon Arterial\n  * Addressed a reported concern that the Gunner could sometimes get stuck in the second area of the Proving Grounds\n  * Addressed a reported concern that players could occasionally escape the Skag of Survival boss area in The Proving Grounds\n  * Addressed a reported concern that the Siren could escape the map while using the “Downfall” ability in Cistern of Slaughter and the Destroyer’s Rift\n  * Addressed a reported concern that the final satellite dish would not appear for the player to destroy at certain distances during “Bad Reception”\n  * Addressed a reported concern that players were unable to break an Eridium crystal cluster in Ambermire\n  * Addressed a reported concern where aim assist was snapping aggressively on the center of an enemy when fighting the Blue Fire and Red Rain boss enemies during “Slaughterstar 3000”\n\n", "2020-01-30-borderlands-3-hotfixes-jan-30": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on\nPlayStation®4, Xbox One, and PC by 3:00 PM PST. This hotfix activates the Rare\nChest Riches event, addresses drop rates, and implements permanent scaling for\n[Takedown at the Maliwan Blacksite](https://borderlands.com/en-US/news/2019-11-22-takedown-at-the-maliwan-blacksite/)! To apply hotfixes,\nwait at the main menu until you see a sign that says \"Hotfixes Applied\"! If\nthese hotfixes are not applied, you will not benefit from the changes! If you\nare experiencing any issues or want to provide feedback, please submit a\nticket to [support.2k.com](https://support.2k.com/).\n\n  * Activated the [Rare Chest Riches](https://borderlands.com/en-US/news/2020-01-30-rare-chest-riches-mini-event/) event, running until February 13\n  * Increased the chance to receive Legendary loot from red car trunk chests\n  * Addressed a reported issue that the player could sometimes rise into the sky with the cannon during the \"One Man's Treasure\" mission in [Moxxi's Heist of The Handsome Jackpot](https://borderlands.com/en-US/news/2019-11-20-moxxi-s-heist-of-the-handsome-jackpot/)\n\n# TRUE TAKEDOWN MODE\n\nWe've been looking at the feedback we received during the [Scaling Event for\nTakedown at the Maliwan Blacksite](https://borderlands.com/en-US/news/2019-12-20-takedown-2020-event/) and have decided to make this Scaled\nevent permanent starting today.\n\nIn a February update, we will include a new switch to re-enable what we call\n_True Takedown Mode_. True Takedown Mode will restore the Takedown to the\n4-player experience that it launched with for extra difficulty. Once\nimplemented, a lever activating True Takedown Mode will be located on the\nright side of the door leading out of the airlock at the beginning of the map.\n\n# RARE SPAWNS AND DROP RATES\n\nOnce the [Farming Frenzy](https://borderlands.com/en-US/news/2020-01-15-borderlands-3-farming-frenzy/) event is over, we are\nimplementing a permanent change to the Rare Spawns and Drop Rates. After\nanalyzing play patterns, we are permanently increasing the spawn rate for\nthese enemies and have buffed their drop rates and their Anointed chance to be\non par with bosses.\n\n# RARE CHEST RICHES EVENT\n\nWhen the hotfixes roll out today before 3:00 PM PST, a new event will be\nactivated! During the [Rare Chest Riches](https://borderlands.com/en-US/news/2020-01-30-rare-chest-riches-mini-event/) Event, which runs until\nFebruary 13 at 8:59am PST, all Rare Chests will drop rare loot at an increased\nrate, so you're more likely to receive Legendary items any time you open one.\nThis increased drop rate will also apply when you watch a Twitch streamer open\na Rare Chest, assuming both of you have the [ECHOcast Twitch\nExtension](https://borderlands.com/en-US/news/2019-10-25-borderlands-3-echocast-twitch-extension-guide/) enabled.\nAny rewards you score while watching streamers will be waiting for you in your\nin-game mailbox the next time you play Borderlands 3. In case you haven't done\nso already, click [here](https://borderlands.com/en-US/news/2019-10-25-borderlands-3-echocast-twitch-extension-guide/) for a step-\nby-step guide to linking your SHiFT and Twitch accounts so you can receive\nECHOcast rewards. The Rare Chest Riches event will also apply to the Stadia\nversion of Borderlands 3.\n\n", "2020-01-23-borderlands-3-hotfixes-jan-23": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on\nPlayStation®4, Xbox One, and PC by 3:00 PM PST. This hotfix addresses various\nconcerns reported by the community and some perceived progression blockers! To\napply hotfixes, wait at the main menu until you see a sign that says “Hotfixes\nApplied”! If you are experiencing any issues or want to provide feedback,\nplease submit a ticket to [support.2k.com](https://support.2k.com/).\n\n  * Updated a texture for the Incendiary Badass and Super Badass Varkid\n  * Adjusted the chest rewards at the end of the Proving Grounds to be more rewarding at all tiers of completion\n\n _With more players running the Proving Grounds for dedicated loot drops from\nthe bosses, we noticed the chests not rewarding players as much as we\nintended. We’ve boosted these chests to reflect the effort players must take\nto complete the objectives. Completing all of the objectives gives the best\nLegendary drop rate and scales down accordingly._\n\n  * Increased bonus radiation damage while Gamma Burst is active from 65% to 115%\n\n _We’re happy to see the response to the boosted Anointment bonuses we\nreleased last week. After additional testing, we want to also boost the\neffects of Gamma Burst anointments for FL4K._\n\n  * Addressed a perceived progression blocker that could occur when the player travels to another map and back to Sanctuary after releasing Tannis during the mission “Sanctuary”\n  * Addressed a perceived progression blocker where players could not speak to Brick during the mission “Hammerlocked” in The Anvil\n  * Addressed a perceived progression blocker where Ember would sometimes not appear to assist the players in various mission steps\n\n", "2020-01-16-borderlands-3-hotfixes-jan-16": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on\nPlayStation®4, Xbox One, and PC by 3:00 PM PST. This hotfix addresses various\nconcerns reported by the community and kicks off the two-week long [Takedown\nEvent](https://borderlands.com/en-US/news/2019-12-20-takedown-2020-event/) and\n[Farming Frenzy](https://borderlands.com/en-US/news/2020-01-15-borderlands-3-farming-frenzy/)! To apply hotfixes, wait at\nthe main menu until you see a sign appear! If you are experiencing any issues\nor want to provide feedback, please submit a ticket to\n[support.2k.com](https://support.2k.com/).\n\n# Takedown at the Maliwan Blacksite and Farming Frenzy!\n\nThis week starts the Takedown at the Maliwan Blacksite event! From when the\nhotfix goes live today until 8:59 AM PT on January 30, Takedown at the Maliwan\nBlacksite will be scaled to the number of players! During this event,\nmatchmaking will be set up to get you into the Takedown as quickly as\npossible. The Takedown is no easy feat, so make sure that you’re ready with\nthe [Takedown at the Maliwan Blacksite Quick\nGuide](https://borderlands.com/en-US/news/2019-11-22-takedown-at-the-maliwan-blacksite/) (keep in mind that this is written for the normal Takedown).\n\nIn addition, during the [Farming Frenzy](https://borderlands.com/en-US/news/2020-01-15-borderlands-3-farming-frenzy/) mini-event running for the\nsame duration, we’re making a few other changes. Rare Spawn enemies will also\nshow up more often*, and we’re temporarily boosting the Anointed and Legendary\ndrop rates! For the next two weeks, every boss in the game has boosted drop\nrates, including the Takedown at the Maliwan Blacksite bosses!\n\nMay these two weeks be challenging, rewarding, and full of loot!\n\n _*The Debt Collector is excluded from this list, as it’s tied to an\nachievement!_\n\n# Bug Fixes\n\n  * Addressed a reported concern with itemcard and hotfix sometimes not showing information correctly\n  * Addressed a reported concern that Judge Hightower was sometimes not dropping items from his dedicated item pool\n  * Adjusted the balance of Fabrikator, Freddie, ST4NL3Y, Constructor, Tony Bordel, Tricksy Nick, and Third Rail to provide a greater challenge\n\n _Developer note – We noticed that the bosses in the Handsome Jackpot weren’t\nproviding players with a satisfying challenge. We’ll be monitoring these\nbosses and make adjustments as needed in the future._\n\n  * The Ion Cannon now has a 5 second reload and consumes at least 6 ammo per shot\n\n _The Ion Cannon is a strong weapon and we don’t want to change that, but it’s\na little over performing._ _We’ve increased the reload time and made it\nconsume more ammo but left its damage unchanged to still provide a strong\nburst of damage._\n\n  * Added collisions to prevent the Gunner from sometimes becoming stuck in Meridian Mercantile\n  * Added collisions to prevent players from sometimes escaping the map in various locations\n  * Increased the radius of the New-U station at The Arrogant Approach\n  * Addressed a reported perceived progression blocker when using Glamour on The Abomination during “It’s Alive”\n\n# Increased Anointment Effectiveness for the Operative, Gunner, and\nBeastmaster\n\nIn looking at the bonuses from Anointments, we felt that some were not\nproviding enough of a bonus. We’ve increased the bonuses on the Anointments\nbelow.\n\n **Moze the Gunner**\n\n  * While Auto Bear is active, deals 75% (from 20%) bonus incendiary damage\n  * After exiting Iron Bear, the next 2 magazines will have 125% (from 40%) bonus incendiary damage\n  * After exiting Iron Bear, gain 160% (from 120%) increased Splash damage for 18 seconds\n  * When entering and exiting Iron Bear, nova damage increased\n\n **Zane the Operative**\n\n  * While Barrier is active, Accuracy is increased by 60%, and Critical Hit damage is increased by 70% (from 30%)\n  * While SNTL is active, gain 100% (from 50%) of damage as bonus Cryo damage\n\n **FL4K the Beastmaster**\n\n  * When exiting Fade Away, nova damage increased\n  * After using Rakk Attack!, gain 50% (from 25%) critical hit damage for a short time\n\n", "2020-01-09-borderlands-3-hotfixes-jan-9": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on\nPlayStation®4, Xbox One, and PC by 3:00 PM PST. This hotfix addresses various\nconcerns reported by the community. To apply hotfixes, wait at the main menu\nuntil you see a sign appear! If you are experiencing any issues or want to\nprovide feedback, please submit a ticket to\n[support.2k.com](https://support.2k.com/).\n\n  * Addressed a reported concern that FL4K's Furious Attack was sometimes not applying bonuses to pet damage as expected\n  * Addressed a reported concern that Rakkcelerate was sometimes not applying the cooldown modifier as stated on the skill's description\n  * Addressed a reported concern that Cheap Tip's total weapon shield capacity was sometimes not appearing in the tooltip on the item card\n  * Addressed a reported concern that The Arbalest of Discipline was sometimes spawning with just shields\n\n **Anointed Enforcer**\n\n _We found an issue where Anointed Enforcer's immunity abilities would\nsometimes cause them to be more difficult than intended. We have lowered their\nhealth temporarily as we investigate further and find a permanent solution._\n\n  * Temporarily lowered the health on Anointed Enforcer\n\n **Takedown at the Maliwan Blacksite**\n\nThank you everyone for your patience as we work on the [scaled Takedown at the\nMaliwan Blacksite event](https://borderlands.com/en-US/news/2019-12-20-takedown-2020-event/). We were unable to bring it to you\nduring New Years, but we are looking to start the event next week!\n\nFrom January 16 to January 30, you'll be able to look forward to a slightly\neasier Takedown as you aim to grab as much of that loot as you can! If you've\nwanted to experience [Takedown at the Maliwan\nBlacksite](https://borderlands.com/en-US/news/2019-11-22-takedown-at-the-maliwan-blacksite/) but were having a hard time making progress or finding a\nparty, this is the perfect opportunity to jump in and wreak havoc on Maliwan's\nmost elite soldiers and robots. After January 30, we're bringing the event\nback up to its intended difficulty level.\n\n", "2019-12-19-borderlands-3-hotfixes-dec-19": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 3:00 PM PST. This hotfix addresses various issues reported by the\ncommunity as well as optimizations to matchmaking. To apply hotfixes, wait at\nthe main menu until you see a sign appear! If you are experiencing any issues\nor want to provide feedback, please submit a ticket to\n[support.2k.com](https://support.2k.com/).\n\n# We’re Bringing in the Mayhem with a Takedown New Year’s Event!\n\nStart the New Year off by jumping into [Takedown at the Maliwan\nBlacksite](https://borderlands.com/en-US/news/2019-11-22-takedown-at-the-maliwan-blacksite/)! From Tuesday, December 31 to Monday, January 16, you can\nenjoy the Takedown balanced to the number of players in your party.\nMatchmaking service will also be temporarily be updated to prioritize getting\nparties into Takedown quickly instead of waiting for a full party during the\nevent. This is a great opportunity for anyone who’s wanted to try the Takedown\nbut was reluctant due to it being scaled to a full party of four!\n\nMake sure to complete the discovery mission from the panel on [Sanctuary\nIII](https://borderlands.com/en-US/news/2019-09-04-borderlands-3-sanctuary-iii/) to have the best matchmaking experience!\n\n# Matchmaking Improvements\n\nWe’ve made some changes to the backend to improve the matchmaking experience\nin Borderlands 3. We’ve also moved the Takedown at the Maliwan Blacksite\nmatchmaking option in the Social panel forward. The Takedown matchmaking\nservice now won’t transition players into the Takedown until a full party of\nfour players have been found. We believe players would prefer matchmaking take\na little longer in order to enter the Takedown with a full party. We’ll be\nmonitoring this change and will adjust as necessary.\n\n# Hotfixes\n\n  * Decreased the shields and armor on Maliwan Deathspheres in the Takedown at the Maliwan Blacksite\n\n _The recent patch improved the navigation of the Deathspheres in the\nTakedown. As a result, these enemies have become much more difficult to track\nand hit. To balance this change, we are lowering their armor and shield\nvalues._\n\n  * Addressed a reported concern that Terror was sometimes not dropping his loot when re-running Agonizer 9000\n  * Addressed a reported concern where loot could sometimes fall through the floor surrounding the Agonizer 9000\n  * Addressed a perceived progression blocker where enemies would sometimes not spawn immediately for the objective “Kill Traitors” in the mission “Porta Prison”\n  * Addressed a reported concern that Zane’s “Trick of the Light” skill was sometimes reporting lower bonus damage values in its description than what it was awarding\n  * Addressed a reported concern that Moze’s “Desperate Measures” skill sometimes wasn’t awarding the damage bonus to Iron Bear’s Right Gun\n\n", "2019-12-12-borderlands-3-patch-dec-12": "Today, we will release an update for [Borderlands\n3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) by\nor before 3:00 PM PST that addresses reported issues with Guardian Rank and\nFast Traveling to Sanctuary III, adds vending machines to Skywell-27, and\nincludes some support for the first DLC: [Moxxi's Heist of The Handsome\nJackpot](https://borderlands.com/en-US/handsomejackpot/), which will be live\non December 19. With this patch also comes a new Hotfix Menu! You will know\nthat hotfixes are applied when you see the menu get a little more festive!\nBelow are the notes for today's patch.\n\n#  **Notes for Patch 5**\n\n### New Content\n\n  *  **Added support for Borderlands 3 DLC: Moxxi's Heist of The Handsome Jackpot. Live on December 19.**\n\n### Stability\n\n  * Addressed a reported concern related to the Grenade Indicator widget\n  * Addressed a reported concern related to the Minimap widget\n  * Fixed a crash that sometimes occurred when exiting the ECHO menu\n  * Fixed a crash that sometimes occurred when a user attempted to load in the game after experiencing a network error\n  * [Console] Fixed a rare crash that sometimes occurred in split screen when players leave the party\n  * Fixed a rare crash that sometimes occurred after idling for ten minutes\n  * [Xbox] Fixed a crash that sometimes occurred in split screen on Xbox One\n  * [PC] Improved network performance on PC to prevent hitching related to friends or networked games\n\n### UI\n\n  * Improved Inventory Menu performance\n  * Improved performance when opening Guardian Rank Menu\n  * [PC] Added support to immediately swap between glyph types when using Auto-Detect\n  * Added numbered icons to the Mayhem Mode icon on the HUD\n  * Added missing Japanese characters\n  * Addressed an issue where all functionality could sometimes be lost when pressing the Options button within the Mode menu before starting a game\n  * Addressed an issue where Mayhem Mode icons on the HUD would sometimes become inconsistent when adjusting difficulty\n  * Addressed an issue where thumbnails and locked state could sometimes become incorrect when viewed in the inventory menu\n  * Addressed an issue where vending machine thumbnails could sometimes be incorrect\n  * Addressed an issue where the Photo Mode settings could sometimes scroll off the screen\n  * [PC] Addressed an issue where the PC text chat UI would sometimes disappear after being opened for the second time during a cinematic\n  * Addressed an issue where Friend Profile icons were sometimes not showing up correctly on the ECHO menu\n  * Addressed an issue where the character icon sometimes failed to be present when viewing the Friends Mail prompt in the Mail Menu\n  * Addressed an issue where clients could sometimes lose functionality when opening the ECHO menu after exiting a vehicle\n  * [Console] Addressed an issue where item cards would sometimes appear cut off when viewing items in chests in split screen\n  * [Console] Addressed issue where small item cards would sometimes be displayed on the wrong player's screen in split screen\n  * Addressed an issue where clients who late joined the Takedown at the Maliwan Blacksite would sometimes not have Spectator Mode button prompts\n  * Addressed an issue where performance could sometimes be negatively impacted by pressing inputs from two different sources while spectating during the Takedown at the Maliwan Blacksite\n  * Addressed an issue where primary and secondary stats could sometimes overlap on Legendary Artifact item cards\n  * Addressed an issue where multiple notifications were sometimes being triggered after having completed a Challenge\n\n### Missions\n\n  * Addressed a perceived progression blocker that sometimes occurred if the player jumped before Chadd did during the mission \"Swamp Bro\"\n  * Addressed a perceived progression blocker where the objective \"Kill Ratch\" sometimes wouldn't update during the mission \"The Family Jewel\"\n  * Addressed a perceived progression blocker during the mission \"In the Shadow of the Starlight\"\n  * Addressed perceived progression blockers related to traveling between environments on Promethea\n  * Addressed a reported concern where waypoints would sometimes fail to appear when obtaining a mission for an environment that hadn't been unlocked yet\n  * Addressed a reported concern where players were sometimes unable to complete Fast Travel Station Zone Progress when exploring Cathedral of the Twin Gods\n  * Addressed multiple issues with ECHO dialog not playing\n\n### Gameplay\n\n  * Buffed the drop rates for Trial bosses, Slaughter bosses, and Rare Spawn enemies\n\n _We've received feedback that farming certain bosses can be more time\nconsuming then others. We agree and as a result, we've buffed the loot drop\nrates on Trial bosses, Slaughter bosses and Rare Spawn enemies._\n\n  * Updated weapons wielded by CoV Badass enemies to use bullet-based variations to cut down on FX spam\n  * Fixed a reported concern where Guardian Rank Perks would sometimes be disabled for users that had already unlocked them\n  * Addressed a reported concern where enemies would sometimes deal excessive damage to vehicles in True Vault Hunter Mode\n  * Addressed a reported concern where the Spiderant King enemy sometimes failed to launch the sticky projectile from his tail when performing a Web Pull attack\n  * Addressed a reported concern that enemies might not spawn from Warp Anchors and Dropships\n  * Addressed a reported concern that Zane's \"Quick Breather\" skill was sometimes not functioning\n  * Addressed a reported concern that Zane's \"Schadenfreude\" skill would sometimes not award the player Shield restoration\n  * Addressed a reported concern that Zane's \"Praemunitus\" skill would sometimes not award the proper size clip on the first clip of the weapon the Digiclone is spawned with\n  * Addressed a reported concern that Moze's \"Stainless Steel Bear\" skill would sometimes not award the damage bonus to Iron Bear\n  * Addressed a reported concern that Moze would occasionally be ejected from Iron Bear immediately after entering it\n  * Addressed a reported concern where a client's camera would sometimes occasionally stutter and lose functionality after performing Amara's \"Downfall\" skill when jumping off a ledge and dying\n  * Addressed a reported concern that Amara's \"Indiscriminate\" skill could sometimes create lots of ricochet bullets when firing the Legendary Maliwan Shotgun \"Projectile Recursion\"\n  * Addressed a reported concern where \"Invulnerable\" shields would sometimes fail to block rounds fired from the Legendary Maliwan Shotgun \"Projectile Recursion\"\n\n### General\n\n  * Added functionality to skip the intro movie once the video has fully loaded\n  * Added vending machines to Skywell-27\n  * Disabled access to Photo Mode during Fight for Your Life\n  * Changed the default send mail error message to encompass additional issues\n  * [PC] Adjusted volume and attenuation to bring music volume up while playing in HiFi mode on PC\n  * Crew Quarter Room decorations now correctly use the rotation of the hook\n  * Optimized Challenges to prevent hitching when saving\n  * Optimized Challenge Completion percentage computation to occur over multiple frames to prevent hitching\n  * Fixed a reported concern where save game could sometimes get bloated with duplicate Challenge data\n  * Fixed a reported concern where save game data could sometimes have a minor leak\n  * Fixed a reported concern where the game would not start up in correct resolution sometimes when using Fullscreen mode and display scaling\n  * Fixed a reported concern where the player could sometimes remain invisible after respawning\n  * Fixed a reported concern where clients would sometimes not see Sanctuary III Fast Travel Stations until they were already in the map\n  * Fixed a reported concern where the D-Pad would sometimes not change selections in the Sanctuary III Fast Travel list\n  * Fixed a reported concern where clients might not unlock Fast Travel Stations after using the Fast-Forward feature\n  * Fixed a reported concern where environments could sometimes appear unnaturally bright due Time of Day errors\n  * Fixed a reported concern where vehicle boost FX could sometimes appear black\n  * Fixed a typo for the spelling of the \"IMMUNE\" text pop in German\n  * Fixed a reported concern where some strings for the Key Binding Menu were not localized\n  * Fixed a reported concern where the Badass Event icon could sometimes show up when the event had been deactivated when using the ECHOcast Twitch Extension\n  * Fixed a reported concern where Cryo destructible pose sometimes did not match character when in ragdoll\n  * [Console] Fixed a reported concern where the Custom Waypoint hint text would sometimes appear in the Zone Map in non-current environments on consoles\n  * [Console] Fixed a reported concern where Photo Mode filters sometimes weren't working properly with HDR\n  * [Console] Fixed a reported concern where Vault Hunter profile cards sometimes didn't pull from local data for split screen players, causing a mismatch in presentation\n  * Fixed a reported concern where the client would sometimes see an unresponsive black screen after accepting an invite during the intro movie\n  * [PC] Fixed a reported concern where the Vault Hunter profile cards on Epic Game Store were sometimes not showing correctly\n\nAs always, you can help us by reporting any issues you are having to\n[support.2k.com](https://support.2k.com/).\n\n", "2019-12-05-borderlands-3-hotfixes-dec-5": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) which will be live on all\nplatforms by 3:00 PM PST. This hotfix addresses various issues reported by the\ncommunity. Hotfixes are applied at the main menu. You should see a sign in the\nbackground when they have been applied. If you are experiencing any issues or\nwant to provide feedback, please submit a ticket to\n[support.2k.com](https://support.2k.com/).\n\nWith this hotfix, the [Bloody Harvest](https://borderlands.com/en-US/news/2019-10-21-bloody-harvest-trailer-info/) event is fading from\nBorderlands 3. As the event ends, you will no longer see Haunted enemies,\ntravel to Heck, or be able to complete Bloody Harvest challenges until the\nspooky season returns next year! Thank you to everyone for the great feedback,\nyour enjoyment, and the amazing spooky shots taken with Photo Mode in Heck!\nWe're taking what we've seen and heard from this event and are exploring how\nto apply these learnings to the next one.\n\n  * Addressed a reported issue where loot was sometimes falling into an unreachable area in Slaughterstar 3000\n  * Addressed a reported issue where the movement speed bonus with Amara's passive ability \"Mindfulness\" when buffed with Spiritual Driver class mod was sometimes extremely high\n\n _Mindfulness was designed with the intent that reaching maximum stacks was\nnot easily achievable so the bonus per grade was high. We want players to take\nadvantage of move speed but not to the extent where parts of the game may not\nfunction correctly._\n\n  * Addressed a reported issue with the Spiritual Driver class mod where it was sometimes awarding damage for all types of damage and not just gun damage\n  * Decreased pet audio so FL4K's Jabber would be less vocal\n  * Addressed an issue where Zane's passive ability \"Death Follows Close\" did not bring the correct bonus to several Kill Skills\n  * Addressed a reported issue where Zane's passive ability \"Nerves of Steel\" would sometimes lose functionality after fast traveling\n  * Fixed typos on Desperate Measures and Stainless Steel Bear skills\n  * Fixed multiple spots where players were sometimes able to escape the map in Skywell-27\n  * Fixed multiple spots where players would sometimes get stuck in Ambermire\n  * Fixed various areas in Septic Sluice and Green Diamond Platform that allowed players to reach unintended areas\n  * Fixed various areas on Pandora that sometimes allowed players to escape the map\n  * Fixed a reported issue where some players could not hear the flaming skulls from Billy, the Anointed\n  * Fixed a reported issue where Brick's sledgehammer sometimes continued to spin after being thrown at an enemy during the mission \"Hammerlocked\"\n\nHotfixes generally address smaller things, while patches contain code that\nmust go through a lengthier patch process. The next patch will be coming later\nthis month and will contain the first DLC, [Moxxi's Heist of the Handsome\nJackpot](https://borderlands.com/en-US/handsomejackpot/)! It will also address\nreported concerns that we have seen in the last patch, including Guardian Rank\nand additional vending machines in Skywell-27.\n\nMoxxi's Heist of the Handsome Jackpot will be available to players on December\n19 who have purchased the [Season Pass](https://borderlands.com/en-US/shop/borderlands-3-season-pass) or the [Borderlands 3 Super Deluxe\nEdition](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition).\n\nAt the end of the month, look forward to spending the new year with Maliwan in\nBorderlands 3! In a time-limited event, the [Takedown at the Maliwan\nBlacksite](https://borderlands.com/en-US/news/2019-11-22-takedown-at-the-maliwan-blacksite/) will be scaled depending on the number of players in your\nparty. You'll be able to play solo or with a party of any size to score all\nthat sweet Takedown loot!\n\n", "2019-11-26-borderlands-3-hotfixes-nov-26": "Today we will release a hotfix for [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition), which will be live on all\nplatforms by 3:00 PM PST, that addresses reported concerns some users were\nhaving with The Butcher after last week's update. Additionally, we're aware\nthat some players reported experiencing other issues after installing the\n[November 21 Patch and Hotfixes](https://borderlands.com/en-US/news/2019-11-21-borderlands-3-patch-hotfixes-nov-21/) and we're working to\naddress those in future updates.\n\n  * Addressed a reported concern where The Butcher could occasionally experience excessive recoil\n\nIf you experience any issues with Borderlands 3, please submit a ticket to\n[support.2k.com](https://support.2k.com/)!\n\n", "2019-11-21-borderlands-3-patch-hotfixes-nov-21": "Today, we will release an update and hotfix for [Borderlands\n3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) by\nor before 5:00 PM PST that adds a bunch of exciting new content in addition to\naddressing community requests and reported concerns! Below are the notes for\nboth today's patch and hotfix.\n\n#  **Notes for Patch 4**\n\n# New Content:\n\n **Takedown at the Maliwan Blacksite**\n\n  * Lorelei has recruited the Vault Hunters to destroy a top-secret weapon Maliwan has been developing at their Blacksite. You and your squad should prepare for an extreme challenge because this content is balanced for four players at level 50. You can gain access to the Blacksite via a mission found on [Sanctuary III](https://borderlands.com/en-US/news/2019-09-04-borderlands-3-sanctuary-iii/) after completing the main campaign with that character.\n  * Takedowns feature special rules not found in the rest of the game! Respawning is disabled, so make sure you and your co-op partners get Second Wind or you'll spectate until the team wipes. If you do die, you're not out permanently! Die during the first half, you'll get to rejoin your team if they defeat the Valkyrie Squad. If you're out the second half, but your team manages to defeat Wotan The Invincible, you'll get to respawn to enjoy the rewards you didn't completely earn!\n  * Make sure your squad is in the session before you throw the switch inside the Air Lock, or anyone who joins after the switch is thrown joins as a spectator!\n\n **Mayhem 4**\n\n  * Mayhem 4 is here for players looking for the toughest challenge in the game! Mayhem 4 adds another increase to enemy health, increases the loot drop chances, and adds a set of new Legendaries! Because the health value greatly increased, Mayhem 4 also slightly adjusts the random modifier system. Mayhem 4 will only roll one positive modifier for the player and one enemy bonus modifier. We want players to try different builds without severely hampering their ability to take down enemies in Mayhem 4. _Note that Mayhem 1-3 are unchanged._\n  * In addition to increasing enemy health and adjusting the modifiers, Mayhem 4 contains new Legendary weapons and class mods for players to hunt. These new pieces of gear will contribute to new builds and new ways to kill enemies!\n  * To support Mayhem 4, we changed the Mayhem station slightly. Players will activate Mayhem through the center pillar and increase or decrease Mayhem levels by using the pillars on each side. Looking forward, we will monitor the challenge of Mayhem 4 closely. We're working hard on Mayhem 2.0, which will add brand new gameplay additions to Mayhem Mode in the future. Until then, we hope you enjoy the challenge and new loot!\n\n **Bank Expansion**\n\nAll characters now begin the game with 20 bank slots instead of 10. The\nexisting Bank SDUs will give everyone a total of 100 available spaces. An\nadditional 10 Bank SDUs are available to purchase in Marcus's shop on\nSanctuary III using the in-game cash currency, each awarding 20 spaces, for a\ngrand total of 300 total bank spaces!\n\n **Dedicated Loot Pools for Bosses**\n\nAll bosses have been updated with new loot pools that give them dedicated\nLegendary items to drop. Players can now discover which bosses drop their\nfavorite gear and more easily farm their favorite items. Let the hunt begin!\n\n **Additional Vending Machines**\n\nThe following environments have received additional vending machines. They can\ntypically be found before bosses or the mid waypoint in larger environments:\n\n  * Athenas\n  * Atlas HQ\n  * Lectra City\n  * Jakobs Estate\n  * Voracious Canopy\n  * Tazendeer Ruins\n  * The Pyre of Stars\n\n **Target Dummy**\n\nPlayers can take out their aggression, or test their gear, on a Handsome Jack\ntarget inside the shooting range on Sanctuary III.\n\n# End Game Character Balance\n\nFor this patch, we adjusted many passives involving companions such as Iron\nBear, Digi-Clone, and FL4K pets in general. We wanted to increase their\nviability for later levels of Mayhem while also targeting some passives that\nwere underperforming compared to some others. Iron Bear saw increases to the\nbase scaling and additional bonuses were added through passives and augments.\nWe allowed some of Zane's kill-skill bonuses to stack up to two times,\nincreasing their output under certain conditions. FL4K pets also saw some\nincreases over level to their damage so that they didn't feel underpowered for\nMayhem Mode. We are currently happy with the variety of Amara's builds, but we\nare always monitoring feedback and will adjust if necessary.\n\n **Moze**\n\n  * Iron Bear Damage increased per level, to a total of just under 150% at max level\n  * Desperate Measures now gives Iron Bear the bonus too\n  * Experimental Munitions - Iron Bear also deals bonus fire damage on critical hits\n  * Scorching RPM's also grants increased Hard Point damage by 5% per level\n  * Vampyr - When Iron Bear deals area damage, Iron Bear receives half the healing bonus\n  * Iron Bear now launches barrels when the player melees them\n  * Increased Iron Bear Bubble Shield from 20% to 50% of Moze's health\n\n **Zane**\n\n  *  _SNTL_ damage scale increased by 2% per level\n  *  _Donnybrook, Pocket Full of Grenades, Cool Hand, Violent Violence,_ and _Violent Speed_ bonuses now stack twice\n  * Fixed _Violent Momentum_ to scale more at higher movement speeds\n  *  _Best Served Cold_ radius and damage increased by 2% per level\n  *  _Confident Confidence_ increased max weapon damage bonus from 20% to 35%\n  * Changed _Trick of the Light_ element to Cryo and increased bonus from 18% to 36%\n  *  _Borrowed Time_ duration increased from 15% to 30% per active skill\n  *  _Double Barrel_ 's bonus increased from 20% to 25%\n  *  _Quick Breather_ now restores 50% of the clone's health after a swap\n  *  _Pocket Full of Grenades_ bonus slightly decreased from 6.5% to 5% as it now stacks\n  *  _Violent Violence_ bonus slightly decreased from 4% to 3% as it now stacks\n\n **FL4K**\n\n  *  _Ambush Predator_ now has a HUD Icon when the buff is active\n  * Increased the pet damage to scale 10/5% per level instead of 9%\n  * Added pet damage to _Grim Harvest_ at 7% per level\n  * Added pet damage to _The Most Dangerous Game_ at 9% per level\n  * Added pet damage to _Interplanetary Stalker_ at 1% per stack, per level\n  * Added pet damage to _Furious Attack_ at 0.6% per stack\n  * Added pet damage to _The Fast and the Furryous_ at 10% per level\n  *  _Lick the Wounds_ gained a pet damage buff after reviving the player\n  * Increased pet damage for _Psycho Head on a Stick_ from 10% to 20%\n  * Increased damage in _Pack Tactics_ from 5% to 7% per level\n  * Adjusted _Megavore_ to not reward critical hit bonuses when receiving damage from self-damage\n\n# Stability\n\n  * Fixed multiple crashes that occasionally occurred when interacting with the ECHO menu\n  * Fixed a crash that occasionally occurred after quitting to the main menu multiple times\n  * Fixed a crash that occasionally occurred when transitioning to Athenas during a 4-player multiplayer session\n  * Fixed a crash that occasionally occurred when Iron Bear was destroyed\n  * Fixed a crash that occasionally occurred when entering or exiting Iron Bear\n  * Fixed a crash that occasionally occurred while in heavy combat with Varkids\n  * Fixed a crash that occasionally occurred in networked games\n  * Fixed a crash that occasionally occurred when split screen party joins another game during Marcus intro\n  * Fixed a crash that occasionally occurred when a split screen user quit to the Main Menu\n  * Fixed a rare crash that occasionally occurred when dropping a piece of gear on PC\n  * Fixed a rare crash that occasionally occurred after 3 clients joined the host\n  * Fixed a rare crash that occasionally occurred when destructible environmental art took damage\n  * Fixed a rare crash that occasionally occurred when a client transitioned to Desolation's Edge\n  * Fixed a rare crash that could occur when entering Fade Away\n  * Fixed a rare crash related to the Time of Day of an environment\n  * Fixed a rare crash that occasionally occurred as a result of improper text fields\n  * Fixed a crash related to the Minimap Widget\n  * Fixed multiple crashes that occasionally occurred when players fast traveled\n  * Fixed a reported issue that prevent the application from terminating properly\n  * Fixed a reported issue where the news widget would hang indefinitely\n  * Disabled the benchmark feature when in a coop group\n\n# UI\n\n  * Improved overall performance in menus\n\n _Note: we are still working on additional performance updates that will be\nimplemented in future updates._\n\n  * Improved performance of bank\n  * [PlayStation 4 Only] Fixed a reported issue that prevented some players from marking items as Junk or Favorite on PlayStation 4\n  * Addressed a reported issue where sorting the inventory by type sometimes sorted the inventory by score\n  * Added 'Sort By Rarity' to Bank, Inventory, Item Trading and Vending Machine Selling\n  * Clients now receive an indication of why their travel attempt failed\n  * Updated names in the credits\n  * Addressed a reported issue where corrupted characters were sometimes displayed for some Fast Travel Stations in Japanese and Simplified Chinese\n  * Addressed a reported issue where characters were sometimes displayed in the incorrect direction for some Fast Travel Stations and Level Transitions in Traditional Chinese\n  * Addressed a reported issue where comparing class mods sometimes displayed the incorrect icons on the abbreviated item cards\n  * Addressed a reported issue where items slots could sometimes overlap when viewing player storage\n  * Addressed a reported issue where the travel countdown timer could sometimes be interrupted by opening the chat window\n  * [PC Only] Addressed a reported issue where occasionally mouse input could be lost\n  * Addressed a reported issue where Item Cards at the beginning of the game didn't display\n  * Addressed a reported issue where missions were sometimes not sorting correctly in the Mission Log\n  * Addressed a reported issue where the friends list could occasionally be too long for split screen\n  * Addressed a reported issue where a player could sometimes lose their HUD in split screen\n  * Addressed a reported issue where the info panel briefly displayed when looking at Planet Challenges\n  * Addressed a reported issue where players could sometimes be sent to the wrong location when selecting a destination quickly in the Map\n  * Addressed a rare issue where a dialog box could not be dismissed\n\n# Missions\n\n  * Addressed a reported issue that could sometimes cause NPCs to get stuck during a teleport\n  * Addressed a reported progression blocker where an NPC leading the player could sometimes break if one of the players left the game\n  * Addressed a reported progression blocker where Lilith could sometimes become stuck during the mission \"From the Ground Up\"\n  * Addressed a reported progression blocker that occasionally occurred when two players tried to accept the quest item at the same time from the slot machine during the mission \"Sanctuary\"\n  * Addressed a few reported progression blockers that occasionally occurred when travelling to another map and back during the mission \"Sanctuary\"\n  * Addressed a reported progression blocker where Lorelei's cyclone could sometimes be lost after players enter and exit the menu during the mission \"Hostile Takeover\"\n  * Addressed a reported progression blocker where the door into KillaVolt's arena sometimes wouldn't open during the mission \"Kill KillaVolt\"\n  * Addressed a reported progression blocker where an Amber Lamps bot could sometimes spawn during the mission \"Dynasty Diner\" and leave the combat area\n  * Addressed a reported progression blocker where Bloodshine's sister could sometimes not spawn during the mission \"Proof of Wife\"\n  * Addressed a reported progression blocker where Rhys-Ball could sometimes become stuck during the mission \"Space Laser Tag\"\n  * Addressed a reported progression blocker where Brick could sometimes become stuck in a concrete block during the mission \"Hammerlocked\"\n  * Addressed a reported progression blocker where Tina sometimes couldn't be spoken to during the mission \"Hammerlocked\"\n  * Addressed a reported progression blocker where Billy, The Anointed would sometimes disappear during the mission \"Lair of the Harpy\"\n  * Addressed a reported progression blocker where split screen clients could sometimes not progress the objective \"Equip Black Flame\" during the mission \"Witch's Brew\"\n  * Addressed a reported progression blocker where Balex could sometimes stop pathing during the mission \"The Family Jewel\"\n  * Addressed a reported progression blocker where Tannis sometimes couldn't be spoke to during the mission \"The Great Vault\"\n  * Addressed a reported progression blocker where Tannis sometimes wouldn't interact with a critical mission objective during the mission \"In the Shadow of Starlight\"\n  * Addressed a reported progression blocker issue where a Tink could sometimes jump outside the barrier during the mission \"Trial of Fervor\"\n  * Addressed a few reported progression blockers during the mission \"The Trial of Survival\"\n\n# Gameplay\n\n  * Rare, Hunt, and Bounty Enemies now always match the players level\n  * Made adjustment to default zoom speed for gamepad\n  * Mayhem Mods that cancel each other out can no longer be active at the same time\n  * Shields that start regenerating immediately after depleting now properly trigger Not Depleted events.  \n\\- Moze is no longer able to infinitely stack the damage, health, and shield\nregen buffs of the Brawler Ward Legendary shield after equipping the\nBloodletter Class Mod.\n\n  * Rough Rider shield properly triggers depleted augments when equipped\n  * Addressed a reported issue where certain shields could provide buffs to players even when not equipped  \n\\- Players can no longer stack the health regeneration buff of the Brawler\nWard Legendary shield on another shield when repeatedly equipping and\nunequipping the Brawler Ward shield in Inventory.\n\n  * Addressed a reported issue where class mods and artifacts were sometimes accumulating action skill cooldowns when respeccing\n  * Addressed a reported issue where Hellwalker anointed parts could sometimes be incorrectly weighted\n  * Addressed a reported issue that sometimes prevented the Zane's barrier from blocking E-Tech weapon projectiles\n  * Addressed a reported issue where FL4K's pets could sometimes be frozen without showing any of the effects of being frozen\n  * Addressed a reported issue where the Action Skill cooldown timer for FL4K's Gamma Burst could sometimes stack cooldowns when players revived or spawned a pet each time\n  * Addressed a reported issue where the skill augment Active Tracking for Moze sometimes didn't target enemies in turrets\n  * Addressed a reported issue where the Mayhem Modifier sometimes failed to affect Eridium gained\n  * Addressed a reported issue where parts of The Anvil were sometimes not properly balanced\n  * Addressed a reported issue where the Mother of Dragons sometimes wouldn't drop her loot\n  * Addressed a reported issue where Rare Spawn enemies might not have spawned during a mission if players had already defeated that enemy during that session\n  * Addressed a reported issue where loot sometimes wouldn't spawn after players had found all Eridian Writings\n\n# General\n\n  * DX12 is now the default Graphics API on Windows 10 for users with AMD video cards\n  * Added support for future types of hotfixes\n  * Added Spectator mode for Takedowns\n  * Explosion effects now dissipate faster\n  * Bullet tracers passing through Zane's shield are more transparent\n  * Improved the general audio performance and memory usage\n  * Save games triggered by money or changes in the inventory have been throttled\n  * Addressed a reported issue where save files had the potential to be deleted after the game crashed in the middle of saving\n  * Addressed a reported issue where Guardian Rank and tokens could potentially be lost\n  * Addressed a reported issue where equipped weapon skins were sometimes not properly displayed\n  * Addressed a reported issue where ECHO themes were sometimes not displayed properly for co-op players\n  * Addressed a reported issue where Clay and Wainwright Jakobs would sometimes not appear properly in their Title Cards\n  * Addressed a reported issue where a Boundary Turret in Floodmoor Basin would sometimes not detect Iron Bear\n  * Addressed a reported issue where Iron Bear could sometimes fall through the platform during the Graveward fight\n  * Addressed a reported issue where players would sometimes load into Tazendeer Ruins facing the wrong direction\n  * Addressed a reported issue where players could sometimes become invulnerable when swapping artifacts\n  * Addressed a reported issue where Rakk could sometimes get stuck behind geometry in The Cistern of Slaughter\n  * Addressed a reported issue where players could rejoin the arena in The Cistern of Slaughter after dying\n  * Addressed a reported issue where Depth of Field would sometimes not work properly in split screen\n  * Addressed a reported issue where the player's shield bar could sometimes disappear from the HUD\n  * Addressed a reported issue where the Vault Symbol on loading screens sometimes appeared incorrectly on consoles\n  * Addressed a reported issue where events would occasionally not work properly if ECHOcast was not enabled before loading into a map\n  * Addressed multiple issues with Badass Events not spawning in certain maps for the Twitch ECHOcast extension\n  * Addressed a reported issue that prevented stats from sometimes properly incrementing while in vehicles\n  * Addressed a reported issue where Service Bots audio would sometimes ignore acoustic data\n  * Addressed a reported issue where player characters would sometimes call out health vials when already at max health\n  * Addressed multiple issues where audio was sometimes muffled or lost\n  * Addressed multiple issues where players would sometimes lose gravity permanently\n  * Edit group hint is now hidden when input is not available\n\n# Hotfix Notes\n\nHotfixes are separate from the update and applied at the main menu when\nBorderlands 3 is connected to the internet. Unlike updates, hotfixes are not\npermanent—they are temporarily stored in memory during the game session and\nlost upon exiting Borderlands 3. To ensure that you receive hotfixes, make\nsure that your system is connected to the internet when Borderlands 3 boots up\nand hang out on the Menu screen until you see the background change (right\nnow, you're looking for pumpkins)!\n\n  * Addressed a reported concern that the Legendary Maliwan \"Recursion\" ricochets sometimes failed to target ghosts\n  * Adjusted Rampager's item pool to allow for specific Legendaries to drop\n  * Addressed a reported concern that \"Boom Sickle\" sometimes showed incorrect part text.\n\nWe still have a lot of things that we're working on, including additional\nperformance and stability updates, Mayhem updates and 2.0, skippable\ncinematics, and more. As always, we appreciate the feedback and support we've\nseen from the community. If you experience any issues with Borderlands 3 or\ntoday's patch, please submit a ticket to\n[support.2k.com](https://support.2k.com/).\n\n", "2019-11-14-borderlands-3-hotfixes-nov-14": "This week's [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) hotfixes, which will be live on\nall platforms by 3:00 PM PDT today, include a couple of potential progression\nblockers and various issues reported by the community. Thank you to everyone\nfor sending in your bugs and feedback to\n[support.2k.com](https://support.2k.com/) and helping everyone out with their\nquestions across social media!\n\nAs a reminder, while [Bloody Harvest](https://borderlands.com/en-US/news/2019-10-21-bloody-harvest-trailer-info/) is active, you will know the\nhotfix has been successfully applied when you see the pumpkins on the Main\nMenu!\n\n# Bug Fixes\n\n  * Addressed a reported concern that players would experience their screen shaking while in a party when one player used Bear Fist\n  * Addressed a reported concern with duplicated audio when Maya turns on the music in \"Beneath the Meridian\" when playing in a party\n  * Addressed a reported concern where players couldn't hear Aurelia's Holographic Doorbell answer the door\n  * Addressed a reported concern where some players were missing the waypoint when quitting out of the map or performing a save and load during the \"Bad Reception\" side mission\n  * Addressed a reported concern that the portal in Destroyer's Rift disappears after completing the mission \"Divine Retribution\"\n  * Addressed a reported concern that the Eridian structures were not resetting after player death during the Tyreen boss fight\n\n# Bloody Harvest\n\nThe Spooky Season is starting to fade from Borderlands 3! Starting with this\nhotfix, you'll start seeing less Haunted enemies until the event ends on\nDecember 5!\n\n  * Lowered the chance to see Haunted enemies outside of Heck.\n\n# Roadmap Reminder\n\nWe have a lot of exciting things coming in the November patch—the most notable\nbeing the free content Takedown at the Maliwan Blacksite and Mayhem 4. If you\ndidn't read the roadmap included with the October 24 patch notes, you can read\nit [here](https://borderlands.com/en-US/news/2019-10-24-borderlands-3-patch-hotfixes-roadmap-oct-24/). As always, please continue providing feedback and\nreporting bugs to [support.2k.com](https://support.2k.com/)!\n\n", "2019-11-07-borderlands-3-hotfixes-nov-7": "This week's [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) hotfixes, which will be live on\nall platforms by or before 3:00 PM PDT today, include quality-of-life\nadjustments to [Bloody Harvest](https://borderlands.com/en-US/news/2019-10-21-bloody-harvest-trailer-info/) and address various issues\nreported by the community. We appreciate all the help. Please keep sending in\nyour bugs and feedback to [support.2k.com](https://support.2k.com/)!\n\n# Bloody Harvest Adjustments\n\n _Captain Haunt is a fun boss fight with multiple phases, but players were\noften skipping entire phases because Captain Haunt's shields were so low. We\nincreased his shields to make the fight slightly more engaging for most\nplayers and dramatically increased the loot drop chance, so players are\ncompensated nicely for defeating Captain Haunt._\n\n  * Increased Captain Haunt's chance to drop legendary gear\n  * Increased Captain Haunt's shields\n  * The Hecktoplasm drop rate from Ghosts has been increased  \n\\- Ghosts drop 2 Hecktoplasm  \n\\- Badass Ghosts drop 3 Hecktoplasm  \n\\- Loot Ghosts drop 5 Hecktoplasm\n\n  * Loot Ghosts now drop more loot\n  * Loot Ghosts have an increased the chance of dropping Bloody Harvest specific legendary gear\n\n# Terror Anointments\n\n _Following what we’ve seen and heard from the Community and the fading\nHalloween season, you’re going to start seeing less Terror anointed parts\ndropping from regular enemies. Bloody Harvest enemies (including Ghosts!) will\nbe picking up the slack, so if you are hunting to make a spooky build you know\nwhere to look!_\n\n  * The chance for Terror anointed parts to drop from regular enemies has been decreased.\n  * The chance for Terror anointed parts to drop from Bloody Harvest enemies has been increased.\n\n# Bug fixes\n\n  * Anointed enemies are no longer immune to Cryo damage.\n\n _Note: Although they can be slowed by Cryo damage, they cannot be frozen._\n\n  * Addressed a reported potential progression blocker for _\"It's Alive\"_ with the Abomination bot.\n  * Addressed a reported potential progression blocker if players quit the game at a certain point in _\"The Guns of Reliance\"_\n  * Addressed a reported issue that Explosive Gunpowder barrels where not showing effects when shot.\n  * Explosions created by enemy Badass' weapons have a much quicker explosion effect to reduce screen clutter\n\n _We found that Badass enemies with heavy weapons were creating too many\nexplosion effects that lingered on the screen, hindering the player's view at\ntimes. We are going to make a larger change to their weapons in the patch but\nwanted to shorten the explosion particle effect to dramatically lower screen\nclutter._\n\n", "2019-10-31-borderlands-3-hotfixes-oct-31": "This week's [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) hotfixes, which will be live on\nall platforms by or before 3:00 PM PDT today, address various issues reported\nby the community. We appreciate all the help. Please keep sending in your bugs\nto [support.2k.com](https://support.2k.com/)!\n\n# Bug fixes\n\n  * Addressed reported collision issues in various maps\n  * Raised the Eridian chest out of the dirt near The Terradome\n  * Made a modification to prevent certain players from escaping out of the Slaughter Shaft\n  * Addressed a potential progression blocker for \" _Footsteps of Giants_ \" mission when fast traveling to a vehicle\n  * Removed an incorrect text description for the Legendary Sniper Rifle _Stalker_\n\n _No change has been made to the gameplay of the gun, only the text has been\nremoved._\n\n  * Addressed a potential progression blocker during the \" _On the BloodPath_ \" mission\n  * Addressed a reported concern that Emperor Spiderants were causing the screen to shake infinitely\n  * Addressed a reported concern where Rachael the Anointed's beam attack was not properly visible on all settings\n  * Addressed a reported concern that Troy was not spawning with his pistol\n  * Fixed a typo on mission text for \" _Blood Harvest: The Rebloodening_ \"\n\n# Weapon fixes\n\n _Tediore E-Tech Shotguns were set to the wrong value and were corrected,\nresulting in a damage increase for all Tediore E-Tech Shotguns._\n\n  * Tediore E-Tech Shotgun Damage increased by 50%\n\n# Bloody Harvest – Happy Halloween!\n\nAs you play Borderlands 3 today, you'll notice it's even spookier! Haunted\nenemies are everywhere!\n\n  *  **For TODAY, October 31 ONLY – You will see a drastic increase in the number of Haunted enemies!**\n\nIt's a great day to work on those Bloody Harvest challenges, Vault Hunters!\nAfter today, the rates will go back to their normal values. In the coming\nweeks, you will start seeing more standard Anointments on your gear as the\nspooky season begins to fade from Borderlands 3.\n\n# Anniversary Event\n\nWe hope you all enjoyed the [Mayhem on Twitch](https://borderlands.com/en-US/news/2019-10-22-borderlands-3-mayhem-on-twitch/) Anniversary event! After\nlistening to community feedback during the event, we are making two changes to\nMayhem Mode:\n\n  * The chance of receiving a weapon penalty as a Mayhem modifier will continue to be reduced at the same rate as the Mayhem on Twitch Week.\n  * The drop rate for Anointed gear has been increased.\n\n# Marking Gear as Trash/Favorite on PS4\n\nAfter downloading last week's patch, some players on PS4 reported that they\nwere unable to mark their guns as trash or favorite while in the inventory\nmenu. We are working on fix for this and intend to implement it in the next\npatch.\n\n# Turning Off Guardian Rank\n\nWe have heard that some of you would like the option to turn off Guardian\nRank. We're currently looking into how that can be achieved and intend to be\nable to provide more information in the future!\n\nAs always, if you experience any issues, please submit a ticket to\n[support.2k.com](https://support.2k.com/). We're listening to your concerns\nand look forward to seeing everyone's feedback from this week. If you missed\nlast week's roadmap, it covers topics like a larger bank, performance and\nstability, character buffs, target dummies, and more. Read that roadmap here:\n[October 24 Patch, Hotfix, and Roadmap notes](https://borderlands.com/en-US/news/2019-10-24-borderlands-3-patch-hotfixes-roadmap-oct-24/).\n\n", "2019-10-24-borderlands-3-patch-hotfixes-roadmap-oct-24": "Today we'll release an update to [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) by or before 3:00 PM PDT that\nfixes a number of reported concerns. In addition, we'd like to outline our\ngoals for patches and hotfixes in the coming weeks. But first, this week's\npatch notes and hotfixes:\n\n[![](https://cdn.2kgames.com/borderlands/news/bloodyharvest-patch-560.jpg)](https://cdn.2kgames.com/borderlands/news/bloodyharvest-patch-full.jpg)\n\n# Notes for Patch 3\n\n  * Added Support for [Bloody Harvest](https://borderlands.com/en-US/news/2019-10-21-bloody-harvest-trailer-info/), the free Limited Time Event starting on October 24 and ending December 5.  \n\\- During the event, the Main Menu will now become spooky when the micropatch\nhas loaded and the event content is available\n\n# Stability\n\n  * Fixed a report bug resulting in a crash while loading into maps\n  * Fixed a reported audio crash bug\n  * Fixed a reported crash that occurred for certain users when level transitioning immediately after throwing a longbow grenade\n  * Fixed a reported rare crash that occurred for certain users after completing missions\n  * Fixed a reported crash that occurred for certain users when swapping an equipped weapon\n  * Fixed a reported crash that occurred for certain users when sorting the Mission Log by region\n\n# General\n\n  * [Consoles Only] Mayhem mode is now available in True Vault Hunter Mode on Consoles\n  * [Consoles Only] Added Photo Mode support for Consoles\n  * [Consoles Only] Added ECHOcast Twitch Extension support for Consoles\n  * Added new Vault Hunter customizations and trinkets\n  * Added ability to specify Mayhem Mode while matchmaking\n  * Adjusted the volume of the 2K and Gearbox logo intro movies\n  * Addressed reported concern where some players were missing skill points\n  * Updated gore stump textures for consistency\n  * [PC Only] Improved reliability of the voice chat system when open and closing the ECHO menu on PC\n  * [PC Only] Added a modification so typing in text chat no longer prevents players from fast travelling\n  * Singularity grenades will no longer cause Saurian corpses to float in the air after dying\n  * Addressed a reported concern that certain players experienced some Visual FX for the side mission \"Transaction Packed\" before accepting the mission\n  * Addressed a reported concern that some players experienced Brick getting stuck after chasing enemies off the cliff near Hector's Lament in The Anvil\n  * Made a modification where Amber Lamps no longer has a chance to spawn during the \"Defend BALEX\" objective of \"The Family Jewel\" mission\n  * Addressed a reported concern with the Legendary grenade mod _Quasar_ , where it was not counting towards the optional grenade kills objective in Slaughter maps\n  * [PS4 Only] Addressed a language code issue present in PS4 activity feeds for English\n  * Addressed a reported concern where users with their region set to Japan were unable to complete the Fast Travel tutorial\n  * Made a modification so Safe Area Calibration is now saved when relaunching the game\n  * Camera no longer resets to a random location when using the Reset Camera function in Photo mode\n  * Photo mode will now force exit when the player is teleported\n  * Subtitles are now present when joining another player's game while a cinematic is playing\n  * Addressed a reported concern where some sounds were quiet or missing for the second player in split screen\n  * Made various split screen UI fixes\n  * Fixed a reported UI issue where the Mayhem Modifier menu would sometimes not appear for certain players\n\n# Notes for October 24 Hotfix\n\nAs stated in last week's stream, this week's changes focus less on weapons and\nmore on fixes across the game. We are gathering data, reading feedback, and\nworking toward improving all aspects of the game. Please keep submitting bug\nreports to [support.2k.com](https://support.2k.com/)!\n\n# Weapons\n\n **Flakker**\n\n  * Now consumes 1 ammo instead of 5.\n\n# Bug Fixes\n\n  * Addressed a reported bug with \"Space-Laser Tag\" which prevented some players from progressing to the next objective\n  * Atomic has been modified to no longer become invincible, as has been reported under certain conditions\n  * Modified Powerhouse Heavy's attacks to no longer damage players outside of the intended range\n  * Addressed a concern that Projected shields were taking too much damage from General Traunt's attacks\n  * Fixed the reported floating door frame in the Jakobs Theatre\n  * Addressed a reported potential progression blocker when Rhy's talks during \"Hostile Takeover\"\n  * Increased checkpoint sizes of New-U stations in multiple locations\n  * Included a modification so that Zane's Digi-Clone will no longer spawn into the cage in Slaughterstar 3000\n\nThose are a lot of notes to take in, and we're still hard at work addressing\nreported issues in Borderlands 3. But given that we're just about a month out\nfrom Borderlands 3's launch, we'd like to take this opportunity to outline our\nplans for future updates, including some of the community's most frequently\nrequested changes. There can always be unforeseen challenges when working on\npatches and hotfixes, so we'll keep you posted on more concrete release\ntimings as these updates continue to progress. Here's a look at some of the\nthings we're working to implement in future patches.\n\n# Performance and Stability\n\nGame performance and stability continue to be our top priorities. The first\nfruits of that labor will be released in our upcoming November patch, with\nvarious improvements game-wide. We've also been hard at work improving the\ngame's stability and more improvements in this regard are expected to be\nincluded in the November patch. Performance and stability will continue to be\nan ongoing effort with more fixes rolled out with each upcoming patch.\n\n# The Bank\n\nExpanding the bank has been the most consistently requested feature by the\ncommunity. We've heard you loud and clear and the groundwork for expanding the\nbank has already started. The first of several planned expansions will\ncoincide with the release of Takedown at Maliwan's Blacksite. Expect a\nsignificant bank expansion that will more than double the existing space.\nAdditional expansions to the bank will continue to be rolled out over future\nreleases.\n\n# Dedicated Loot Pools for Bosses\n\nSeveral of you have stated a desire to find gear more easily in the game. To\ndo that we are updating the loot pools (the data that determines what in-game\nitems drop) to ensure that more specific gear drops from bosses. That means\nyou'll be able to go to a specific boss to get the specific gear you're\nlooking for. We're working out which bosses get which gear right now and\nexpect this to be ready as part of the November patch as well.\n\n# Character Buffs\n\nIn the late stages of the game when Mayhem Mode is active, we've found that\nplayer companions (Moze's Iron Bear, FL4K's pets, and Zane's Digi-Clone/SNTL)\nare reportedly not performing as well as we had expected. To address this,\nwe're looking at how to adjust damage according to the relevant skills and\ngear. The goal here is to make sure we have as many viable character builds as\npossible.\n\n# Additional Mayhem Levels and Mayhem 2.0\n\nMayhem Mode has been a fantastic addition to the Borderlands world. After\nreceiving some great community feedback, we've been hard at work on a\nsignificant revamp that will introduce a host of improvements over several\nupcoming updates.\n\nThe first update will be released as part of the Takedown at Maliwan's\nBlacksite and includes the first new Mayhem Mode level, Mayhem 4. Expect a\nsignificant challenge when it debuts, with tougher enemies that reward players\nwith highly synergized character builds. A new batch of Legendary gear will\nalso only drop while in Mayhem 4 to reward those players who are truly up for\nthe challenge.\n\nLonger term we have plans to overhaul Mayhem Mode with more UI support, new\nMayhem Modifiers that change gameplay more dramatically, Mayhem playlists, new\nrewards, and additional levels of Mayhem to work through. We're excited about\nMayhem 2.0 and we'll talk more about it when we get a little closer to its\nrelease.\n\n# Vending Machines\n\nMarcus heard the outcry for more vending machines, so we're airdropping in\nsome more across multiple maps. Expect new ammo and health vending machines\noutside of a few boss arenas and a few in some of the bigger environments.\nBelow are the locations where the new vending machines will be appearing:\n\n  * Athenas\n  * Atlas HQ\n  * Skywell-27\n  * Lectra City\n  * Jakobs Estate\n  * Voracious Canopy\n  * Tazendeer Ruins\n  * The Pyre of Stars\n\n# Skippable Cinematics\n\nWe're currently investigating the best way to approach letting players skip\ncutscenes. This is much easier said than done. Under the hood, the game may\nactivate critical events based on cinematics. In order to make sure mission\nprogression isn't negatively impacted, we need to inspect each cinematic and\nmake sure those events still work correctly. We have a few ideas on how to\ntackle this problem and expect to have a solution soon.\n\n# Target Dummy\n\nNeed an easier way to test your gear? We're going to add a target dummy to the\nshooting range on Sanctuary III! We feel this is the best location since your\nbank is also on the ship. This way you can manage and test your builds on\nSanctuary III without having to travel anywhere else. You can expect to see\nthis sometime in December.\n\n# The Future\n\nThe list above is only a high-level look at what some of our teams are working\non. Stay tuned as we continue to add more information and additions to this\nlist. We here at Gearbox are excited about where Borderlands 3 is heading, and\nwe look forward to showing you all the content that's still to come!\n\n", "2019-10-17-borderlands-3-hotfixes-oct-17": "This week’s [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) hotfixes, which will be live on\nall platforms by or before 3:00 PM PDT today, adjust Legendary gear across all\nmanufacturers. Our goal with Legendary gear is to enable a large variety of\nplaystyles and builds for all characters. After looking through the data, we\nfound that that some pieces of Legendary gear were greatly outperforming\nothers and felt they were limiting builds instead of increasing them. In\naddition, some of the damage output of Legendary gear limited the growth in\ncombat engagements for the future so we tuned everything to an acceptable\nmedian. We expect all Vault Hunters to be able to create amazing builds and we\nwant to support that with more ways to grow and reach those power levels.\n\n# Weapon Hotfixes\n\n **Maliwan**\n\n  * Westergun damage increased by 25%\n  * ASMD damage increased by 28%\n  * Cutsman damage reduced by 25%\n\n **Tediore**\n\n  * Ten Gallon damage increased by 8%\n\n **Vladof**\n\n  * Sickle reload speed increased by 25%\n  * Faisor damage increased by 15%\n  * Infiniti damage increased by 40%\n  * Magnificent damage increased by 25%\n  * Jericho damage increased by 40%\n  * Lucian’s Call accuracy and handling reduced\n  * Lyuda Critical Damage Bonus decreased by 30% and made a modification to address a reported bug that an extra bullet was spawned in the center\n\n _The Lyuda’s functionality is to split the projectile from 1 to 3 after a\ncertain distance. It was reported that the original projectile was never\ndestroyed in the process of splitting so 1 projectile actually became 4.\nAddressing this concern effectively removed a full shot’s worth of damage\nwhich auto-corrects the base damage of the weapon. Since we increased all\nsniper rifle critical damage bonus in a previous hotfix, we reduced some of\nthe critical damage bonus on the Lyuda._\n\n **Torgue**\n\n  * Try-Bolt damage increased by 25%\n  * Alchemist damage increased by 25%\n  * Devils Foursum damage increased by 13%\n  * Flakker now consumes the full magazine when fired and damage is reduced by 33%\n\n _Flakker was greatly outperforming other shotguns due to the number of\nprojectiles and the high rate of fire. We initially believed the resulting\nprojectile spread would cause most of the explosions to miss the target,\nhowever this turned out to be false, so we reduced the projectile damage and\nallowed the weapon to only fire once per magazine. This change encourages\nplayers to capitalize on different stat bonuses to maximize the weapon’s\ndamage output._\n\n  * Laser-Sploder rocket projectiles spawn interval increased by 0.4 seconds\n\n **Jakobs**\n\n  * Maggie damage increased by 35%\n  * Hellwalker damage reduced by 8%\n\n **Hyperion**\n\n _We found that a couple of the Legendary Hyperion weaponry bypassed the\nHyperion manufacturer playstyle too easily making their bonuses greatly\noutweigh the penalties. The Butcher was drastically outperforming all metrics\nand we chose to reduce the damage in order to keep the fast fire rate._\n\n  * Conference Call damage increased by 15%\n  * Crossroad accuracy reduced and it now fires 3 projectiles instead of 4\n  * Butcher accuracy reduced and damage reduced by 25%\n\n **DAHL**\n\n  * Vanquisher damage increased by 20%\n\n **Children of the Vault**\n\n  * Skeksis damage increased by 15%\n  * Linoge damage increased by 20%\n  * Pain is Power damage increased by 25%\n\n **Atlas**\n\n  * Ruby’s Wrath damage increased by 10%\n\n **Grenades**\n\n _Hex and Firestorm were calibrated to the wrong grenade modifier. These two\ngrenades were envisioned to specialize by applying elemental DoTs to targets.\nInstead they were resulting in large amounts of damage and the elemental DoTs\nwere minimal. We realize this is a drastic change on both of these grenades,\nbut we did not want to remove the spectacle of the grenade (number of grenades\nspawned, number of targets hit, etc.) and focused on allowing their core\nidentity to be emphasized instead of them continuing to just be high damage\ngrenades._\n\n  * Hunter-Seeker damage increased by 25%\n  * Hex grenade damage reduced by 70% and duration reduced to 3 seconds\n  * Firestorm damage reduced by 70%\n\n **Artifacts**\n\n _It was reported that the Legendary artifact, Elemental Projector, had a bug\nresulting in the max value being displayed at 183% instead of the actual max\nvalue of 113%. Therefore, we addressed the discrepancy and reduced the max\nvalue to 90%._\n\n  * Elemental Projector damage max roll reduced to 90%\n\n# Vault Hunter Adjustments\n\n _The current state of Moze’s Iron Bear, Zane’s Digi-Clone, and FL4K’s pets\nhave made players focus on other elements besides those Vault Hunter’s\nfundamental action skills in the late game. While longer term solutions to\nscaling their damage is explored, we have boosted the health of Iron Bear, the\nDigi-Clone, and the pets to make them more viable. We will have more to say\nabout long term solutions for these characters in the future._\n\n  *  _Iron Bear:_ health increased by 50%\n  * All pets’ health increased by 50%\n  *  _Digi-Clone:_ health increased by 100%\n  * Addressed a bug with _Salvation_ where grenades were giving life-steal\n\n# Bug Fixes\n\n  * Psychos will now use their True Vault Hunter Mode name in True Vault Hunter Mode\n  * Removed the optional Rare Spawn missions from Galaxy Progress\n  * Addressed a reported bug where Completely Sane Sid didn’t always become hostile when using FL4K\n  * Addressed a reported bug where Ratch would not properly spawn during “Ratch’d Up”, which potentially blocked completion of that side mission\n  * Included a modification so Lilith would continue to move toward the door in Shiv’s confession chamber during “From the Ground Up”\n  * Lowered the chance for a weapon to drop from the Pachinko machine\n  * Included a modification so that Zane’s Digi-Clone will no longer spawn into the cage in Cistern of Slaughter\n  * Shield Boosters were modified and are now set for autopickup\n  * An addition was introduced so Eridium chests are no longer listed as Red Chests in the ECHOcast extension on Sanctuary III\n\n", "2019-10-10-borderlands-3-hotfixes-oct-10": "This week's [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) hotfixes, which will be live on\nall platforms by or before 3:00 PM PDT today, address some player character\npassive abilities, gear balance, and some quality-of-life issues across the\ngame. We're watching the character builds that players are creating and are\nlooking through all the different gear available to make sure that there is\nsomething for everyone. This week, and in the coming weeks, there will be\nfurther adjustments to gear with the hopes of creating even more build types.\nOur goal is to adjust some of the less-used Legendary gear to bring them to\nthe same level as some of the more popular options.\n\nIn addition, we are addressing reported bugs and are hard at work continuing\nto address other performance concerns. Thank you so much for your feedback and\nsupport. Please continue to submit any bugs you run into at\n[support.2k.com](https://support.2k.com/).\n\n# Vault Hunter Adjustments\n\n**Amara**\n\n _We addressed a concern that_ Alacrity _was only rewarding players one point\nworth of bonuses even if the player put in more than one point. In addition,\nwe wanted_ Phasegrasp _to be more accessible to all weapon types and play\nstyles, so we doubled the range to grasp an enemy._\n\n  * Putting points into _Alacrity_ now awards a reload speed bonus per rank\n  *  _Phasegrasp_ can now be used on targets further away and the cooldown is now instantly returned if a player misses\n\n **Moze**\n\n _The_ Bloodletter _class mod was creating some overwhelming synergies for\nMoze so we increased the delay and decreased the recharge rate of the shield\nto compensate. This should help encourage the intended use of this class mod,\nwhich is to heal shields manually, not automatically._ Means of Destruction\n_’s re-trigger delay was adjusted again because the change limited other\nbuilds beyond creating infinite grenades. The infinite grenade bug will be\naddressed in a future patch but we wanted to enable other builds that use_\nMeans of Destruction _so we dramatically reduced the re-trigger delay to a\nreasonable number._\n\n  *  _Bloodletter_ Class Mod  \n\\- Increased the Recharge Delay by 150%  \n\\- Reduced the Recharge Rate by 50%\n\n  * Addressed a reported bug with _Close the Distance_ so the Action Skill Augment will now deal the intended Shock Damage\n  *  _Means of Destruction_ now has a re-trigger delay of 0.3 seconds\n\n **FL4K**\n\n _The_ Leave No Trace _change last week to FL4K was to forcefully inject the\nfunctionality of a cooldown into the ability. However, the value that was\nadded was never the intended the value. We dramatically lowered it to retain\nthe promise of the ability but with a cooldown that still allows players to\ngain ammo without dramatically removing a core aspect of a weapon’s gameplay\nloop._\n\n  *  _Leave No Trace_ now has a re-trigger delay set to 0.3 seconds\n\n **Zane**\n\n  *  _Death Follows Close_ will correctly update several Kill Skills after unlocking this ability\n\n# Weapon Hotfixes\n\n  * The Lob's projectile tick damage is now 60% of base damage (up from 20%) and projectile speed decelerates faster to increase chances of hitting the same target multiple times\n  * Creeping Death damage increased by 200%\n  * Carrier damage increased by 60%\n  * Gunerang damage increased by 20%\n  * All Sniper Rifle Zoom Levels have been slightly reduced\n  * Long scopes on Jakobs, Children of the Vault, and DAHL Assault Rifles have also been slightly reduced\n  * Anointed Parts:  \n\\- When Zane swaps positions with his Digi-Clone, the damage gained is\nincreased to 130% (up from 75%)  \n\\- When FL4K hits a target with Rakks, the target now takes 100% increased\ndamage (up from 50%)  \n\\- The Anointed part \"Increased damage vs Badasses\" no longer heals the player\nand now correctly adds bonus damage to Badass enemies\n\n# Bug Fixes\n\n  * Pain, Terror, and Agonizer 9000 have been adjusted to have an increased chance to drop higher quality loot\n  * Addressed a reported bug with Dynasty Diner that could potentially halt mission progress for some players\n  * Addressed a reported concern that some players fell through the floors in various boss arenas\n  * Modified enemy spawn level discrepancies reported in the later parts of the campaign\n\n _We noticed that some enemies were spawning at lower levels than expected in\nthe later parts of the campaign. Players should no longer see enemies that are\ndramatically lower levels than other nearby enemies in certain areas._\n\n", "2019-10-03-borderlands-3-patch-hotfixes-oct-3": "Today we’ll release both a patch and a hotfix for [Borderlands\n3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) on\nall platforms by or before 3:00 PM PDT, with the patch addressing a number of\nreported concerns and the hotfix focusing on player character balance changes\nand tuning of some enemies and bosses.\n\nFirst up are the patch notes:\n\n# Stability\n\n  * Addressed a reported issue where an infinite loop could occur when hitting the Guardian Rank experience ceiling\n\n# General Fixes and Improvements\n\n  * The _Hollow Point_ Guardian Rank skill no longer damages yourself or allies\n  *  _Hollow Point_ Guardian Rank skill has been re-enabled\n  * Addressed a reported issue where some players were unable to unlock the _Ultimate Vault Hunter_ achievement on Xbox\n  * Addressed a reported issue where mouse functionality may have been lost when hot joining a friend’s session on PC\n  * Addressed a reported issue where some players’ inventory would not be saved in their bank\n\nThis week’s Borderlands 3 hotfixes, which will be live on all platforms by or\nbefore 3:00 PM PDT today, contain some player character balance changes and\naddress some player reported concerns regarding enemy behavior.\n\nOur goal is to make sure all three Action Skills for each Vault Hunter are\nviable, but we have noticed some skills have been outperforming others. To\nencourage more build diversity, we made some adjustments to FL4K and Moze this\nweek.\n\nWe also looked at a few boss fights and made balance changes to make their\ncombats more enjoyable. Finally, we went over some enemy behaviors that could\nhave affected mission progression and adjusted some attacks to happen with\nmore frequency.\n\n# Vault Hunter Adjustments\n\n **FL4K**\n\n _Rakk Attack!_ is great for constant damage output, especially when paired\nwith Anointed gear. The base skill still seems to be lacking, so _Rakk\nAttack!_ now has a guaranteed status effect on any enemy that it damages.\n_Leave No Trace_ was returning much more ammo than intended, and we have added\na re-trigger delay to keep its ammo return within expectation. _Barbaric Yawp_\nhas an increased bonus, as we didn’t feel that the amount of investment had an\nequal payoff. In addition, we felt that FL4K’s pets were demanding too much\nattention, which was interfering with players trying to stand still for any\nlength of time, so we disabled the ability for them to move you around.\n\n  *  _Rakk Attack!_ status effect chance as been increased to 100%.\n  *  _Leave No Trace_ now has a re-trigger delay of 2 seconds\n  *  _Barbaric Yawp_ stat bonus increased by 100%\n  * Pets no longer push around player characters\n  * “Touch Pet” prompt is now a lower priority and should no longer interfere with looting or vending machines\n\n **Moze**\n\nInfinite Grenades is not an intentional build for Moze—even if it is\nhilarious. To lower the power (and spam) of this build, a re-trigger delay has\nbeen added to the grenade portion of _Means of Destruction_.\n\n  *  _Means of Destruction_ now has a re-trigger delay of 2 seconds\n\n# Miscellaneous Changes\n\n  * Adjusted the balance of Gigamind, Katagawa Ball, and Billy the Anointed\n\n _These three boss fights had concerns with their health and shields that made\ntheir combat loops more difficult than we intended. Gigamind had a little too\nmuch health, so that was reduced slightly. Katagawa Ball will no longer\nregenerate its shields; we found that while players contended with the adds\nduring the fight, it would unfairly regenerate its shield, negating the\nplayers’ progress. Finally, Billy had 25% of his health removed; we agree that\nthis fight often dragged on needlessly. We will be monitoring each of these\nbosses and may make further adjustments in the future._\n\n  * Bloated Rakks no longer spawn so many Rakklesnakes\n\n _This change should make the Cistern of Slaughter in particular much more\nfun._\n\n  * Adjusted the cooldown values when they are displayed for Zane’s skills\n  * Amara’s _Glamour_ will now turn enemies on each other, as described in the Action Skill\n  * Modified the loot spawn for Sera of Supremacy\n  * Spiderant Emperors occasionally wouldn’t drill back out of the ground, which created a potential progression blocker in the Proving Ground of Survival; we have adjusted this and the issue has been addressed\n  * Resolved an issue that could have prevented enemies from spawning while in Devil’s Razor\n  * Lavender Crawly’s physics were adjusted to prevent them exiting the world like a popped balloon\n  * Further safe guarded Apollo from being launched out of world as well\n  * The Rampager will no longer enter an idle at state at inappropriate times\n  * Saurian Slingers attacks were addressed\n  * Guardians now use all their attacks in Playthrough 2\n  * Guardian Wraiths now reliably use all their ranged attacks\n  * NPCs in the Slaughter maps were reported to sometimes attempt to automatically revive players in the arena. Going forward they will no longer attempt to revive players\n  * Minimized the glow effect when opening Eridian ammo chests, can more easily see the ammo inside when opened\n\n", "2019-09-27-borderlands-3-hot-fixes-sept-27": "This week’s [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) hotfixes, which will be live by or\nbefore 3:00 PM PDT today, target weapon & enemy balance, player characters,\nand adjusting chances of specific unique drops. Billions of guns were fired\nand after collecting some data, we wanted to balance some weapon types and\nweapon manufacturers. These adjustments are intended to even the playing field\nand increase build diversity for all Vault Hunters. Speaking of build\ndiversity, Zane has received a gadget upgrade and we’re excited to see players\ncreate more unique builds with him! Many Crew Challenge enemies have specific\nloot drops but we received reports that some were not dropping them. We have\nmade some modifications so they now have an increased chance of dropping their\nunique gear in addition to any other gear that may drop!\n\n# Weapon Hotfixes\n\n _Sniper Rifles_\n\n _Sniper rifles deal high damage but felt a little cumbersome to use in\ncertain scenarios. This change will increase their overall damage and increase\nusability in more combat engagements._\n\n  * Critical Damage increased by 20%\n  * Fire Rate increased by 15%\n  * Time to Aim Down Sights (ADS) reduced by 15%\n  * Time to Equip reduced by 20%\n\n _Pistols_\n\n _Jakobs and Torgue Pistols were outperforming other manufacturers, dealing\ndamage to groups of enemies at a much higher rate than other pistols. This\nchange keeps their identity intact but reduces overall group control. TEDIORE,\nDAHL, and Children of the Vault Pistols have manufacturer penalties that\naffected their overall damage. Increasing their overall damage will overcome\nsome of the penalties while retaining their unique gameplay style and feel._\n\n  * Increased damage on all TEDIORE Pistols by 15%\n  * Increased damage on all DAHL Pistols by 15%\n  * Increased damage on all Children of the Vault Pistols by 20%\n  * Reduced damage on Jakobs Pistols by 15%\n  * Reduced damage on Torgue Pistols by 10%\n\n _Maliwan Manufacturer_\n\n _Maliwan weapons had reduced overall damage because they applied elemental\nDoTs at a rate and damage greatly above other manufacturers. This effect was\ntoned down before launch, but the overall damage was not sufficiently adjusted\nto compensate for the reduction in elemental DoTs. We’re adding back some of\nthe overall damage and making the weapons faster so elemental builds can\nreally take advantage of Maliwan weaponry._\n\n  * All Maliwan Weapon Damage increased by 25%\n  * All Maliwan Weapon Fire Rate increased by 20%\n\n _Atlas Manufacturer_\n\n _Atlas weapons relied on a game loop that we felt gave players a greater\nadvantage when used correctly. Turns out the loop is not used if the damage\ndoesn’t compensate for the time to set up. So now damage on Atlas weapons\nshould facilitate players using them in general on top of feeling badass when\nthey take advantage of Atlas technology._\n\n  * All Atlas Weapon Damage increased by 25%\n\n _Miscellaneous Adjustments_\n\n _The Jakobs Assault Rifle change was to differentiate the Assault Rifle from\nthe pistol as more of a mid to long range powerhouse. Since the Assault Rifles\nhave low mag sizes compared to other Assault Rifles, they’re getting a slight\nincrease to overall damage to compensate. DAHL SMGs had their Fire Rates\nadjusted down before launch but their damage was never sufficiently increased\nso they should feel more appropriate compared to other SMGs. And the Vladof\nHeavy Weapon damage has been increased to share in the full Heavy Weapon\ntreatment._\n\n  * Jakobs Assault Rifles Damage increased by 20%\n  * DAHL SMG Damage increased by 10%\n  * Vladof Heavy Weapon Damage increased by 25%\n  * E-Tech TEDIORE Shotgun Damage increased by 50%\n\n _Legendary Modifications_\n\n _We’re going to be making a larger, comprehensive Legendary gear pass but we\nhave included the following changes. King’s and Queen’s Call were modified to\nlower the fire rate. The weapon has a limited burst shot count so overall feel\nof the gun isn’t dramatically affected._\n\n  * King’s and Queen’s Call Fire Rate reduced by 50%\n  * Firestorm and Storm base Charge Times were reduced to 1 second (down from 2)\n\n# Graveward\n\n _Graveward’s beam attacks did not properly scale based on level so at higher\nlevels, the two beam attacks hardly phased players. Players will find his\nattacks to be more lethal now. In addition, Graveward is a very large enemy\nand is too easily susceptible to elemental damage unlike the other large\nbosses. Elemental damage on Graveward is now greatly reduced but to\ncompensate, Graveward’s overall health was reduced._\n\n  * Attacks of Graveward now scale based on level\n  * Reduced overall health by 20%\n  * Increased resistances to Elemental Damage  \n\\- Elemental Chance Resistance increased by 70%  \n\\- Elemental Resistances increased by 30%  \n\\- Elemental DoT Duration taken reduced by 30%\n\n# Miscellaneous Changes\n\n  *  _Hollow Point_ Guardian Rank has been temporarily disabled. We plan on addressing this further in a future patch.\n  * Vault Hunters should no longer scream when affected by a DoT while shields are active.\n  * Vending Machines will now be restocked with higher quality “Items of the Day”.\n  * Adjusted a visual concern on Maliwan Shotguns with Cryo Element.\n  * Legendary loot drops have been balanced throughout the game. Crew Challenge enemies will drop their intended specific loot, and some enemies like Troy and Rampager will be a bit more stingy and no longer drop Legendaries every kill.\n\n# Vault Hunter Adjustments\n\n _Zane_\n\n _Zane’s gadgets were great at providing additional utility but lacked impact\nas players leveled up. We increased the Digi-Clone damage with all equipped\nweapon so the skill can scale better with players as they get to higher levels\nand harder content. The Drone requires a lot of player involvement to take\nfull advantage of its damage output and increasing the base damage as well as\nthe augments will greatly increase the Drone’s versatility and reward players\neven more for using it effectively._\n\n  * Digi-Clone Damage Increased by 38%\n  * Drone Damage increased by 50%  \n _\\- Cryo Bullets_ damage penalty removed  \n _\\- Drone Rocket_ damage increased by 50%  \n _\\- Almighty Ordnance Rockets_ damage increased by 75%\n\n _Amara_\n\n  *  _Guardian Angel_ health restoration reduced from 100% to 50%\n  *  _Glamour_ damage penalty reduced from -30% to -10%\n\n _FL4K_\n\n _Guerillas in the Mist’s bonuses greatly outweighed its penalty to the base\nskill. We don’t want to remove the playstyle completely, but the overall\ndamage output had to be slightly adjusted because it was outperforming other\nbuilds. We’re monitoring the changes and may make another change to the ammo\nreturn in a future patch._\n\n  *  _Guerillas in the Mist_ duration reduced from 8 seconds to 6 seconds\n  *  _Guerillas in the Mist_ Critical Damage Bonus reduced from 50% to 25%\n\n", "2019-09-26-borderlands-3-patch-sept-26": "Today we'll release an update to [Borderlands 3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) by or before 3:00 PM PDT that\nfixes a number of reported concerns:\n\n _Performance_\n\n  *  **[PC Only]** Reduced the amount of texture streaming that was occurring when aiming down sights.\n  * Addressed a reported concern where certain users with a lot of people in their friend's list saw more frequent hitching.\n  * Implementing General stability improvements.\n\n _General Fixes and Improvements_\n\n  * Addressed a reported issue where KillaVolt's Shield Storm attack does not disable the tiles around KillaVolt, resulting in the entire floor being activated (oops).\n  * Addressed a potential progression blocker in the mission \"Footsteps of Giants\".\n  * Addressed a reported issue where Guardian Rank had the potential to become non-functional and/or the player could potentially lose Guardian Rank tokens into the negatives.\n  * Modified vending machines so it will now sort items by rarity.\n  * Console FOV is now set to 75 by default. This will not affect players who have already started the game.\n  * Special prompts for particle text (Tediore guns, \"critical\", \"immune\") are now properly localized.\n  * Addressed a reported concern that certain players experienced where their vehicle's boost could continue into the next map.\n  * Addressed a reported concern with \"Porcelain Pipe Bomb\" where it set off multiple explosions when colliding with objects.\n\n _This grenade was never meant to explode multiple times. All enemies in the\nBorderlands universe are now safe from being instantly melted by radioactive\npoop._\n\n _UI_\n\n  * Adjusted the verbiage for \"left stick\" and \"right stick\" inside the Russian localized version of the control options screen.\n  * Addressed a reported issue where certain users experienced a failure of the audio to play when spending skill points in the UI.\n  * The text is now correctly marked \"invalid\" when you enter an invalid e-mail address on the SHiFT account creation page.\n  * Addressed a reported issue where the item of the day item card would flash briefly before displaying on vending machines.\n  * Addressed a reported concern that certain players were served an unread mail icon when they didn't have mail to read.\n  * Iron Bear button prompts will now correctly update if you re-bind your controls.\n  * Modified various features and elements of Crazy Earl's store.\n  * Addressed a reported issue where subtitles wouldn't display until after the initial cutscene.\n  * Addressed an issue experienced by certain players that social notifications could become stuck on-screen.\n  * Addressed a player concern that certain item preview images were failing to load inside the player bank.\n  *  **[PC Only]** Addressed an issue reported by certain PC players where the focus from the mouse's last known location was sticking around even when playing with a gamepad.\n  * Addressed an issue reported by certain players where the cursor would snap to an unintended location in the UI.\n\n _Splitscreen and Online Multiplayer_\n\n  * Addressed a concern reported by certain players that the dialog volume faded too low before switching to ECHO audio during split-screen gameplay.\n  * Addressed a concern reported by certain players that sounds were quiet or missing for the second split-screen player if they move too far from player one.\n  * Addressed a concern reported by certain players that 3-player groups were having trouble matchmaking with an additional solo player.\n  * Addressed a reported concerned experienced by certain players that in split-screen one player's sprinting animation could be interrupted by the other player opening the ECHO menu.\n  * Addressed a concern reported by certain players that in split-screen where one player's aiming down sights could be interrupted by the other player opening the ECHO menu.\n  * Addressed a handful of reported client replication issues:  \n\\- Addressed Tina's pizza bomb so it displays correctly for clients.  \n\\- Modified certain audio elements that were reportedly looping for clients.  \n\\- Addressed a reported player concern so the Guardian Skill \"Dead Man's Hand\"\nnow functions properly.\n\n  * Player icons are now pinned to the side of the mini-map when playing in any kind of multiplayer.\n\n _This update contains the first batch of performance fixes. It’s far from\nexhaustive, but we wanted to address issues and concerns with changes that\nwere ready and tested out as soon as possible while the team continues active\ninvestigation and work on additional performance improvements for upcoming\npatches._\n\n _If you’ve noticed a potential concern that has affected you that is not\naddressed in this update, please send us your data! Many factors are at work\nand collecting info from a variety of folks can go a long way to help us find\ncommonalities, identify the root cause, and address confirmed issues._\n\n _The best way to get us your data would be to open a support ticket (_[\n_http://support.2k.com_](http://support.2k.com) _) and include the following\ninformation:_\n\n _1\\. Summary of the issue.  \n2\\. Frequency of the issue – how often is this happening?  \n3\\. The platform you’re playing on (PS4, PS4 Pro, XB1, XB1X, PC)  \n3a. If PC, a dxdiag log and crash dump.  \n4\\. Your game state when you experienced the issue: (map, mission, character,\nplayer level, playthrough+, single player vs. multiplayer, offline vs. online,\netc.)  \n5\\. Do you know the steps to make this problem happen again? What are they?_\n\n", "2019-09-19-borderlands-3-hot-fixes-sept-19": "Today we released a small update to [Borderlands\n3](https://borderlands.com/en-US/shop/borderlands-3-super-deluxe-edition) that\nfixes a number of reported bugs and implements some balance updates:\n\n **Bug Fixes**\n\n  * Yellow paint has been added to Ambermire to mark a more obvious path to complete the Sabotage Crew Challenge.\n  * The New-U Station in front of the Halcyon Suborbital Spaceport (used during the \"Space-Laser Tag\" Mission) in the Meridian Metroplex now has a larger activation range.\n  * The New-U Station in front of Titan's Gate (used during the \"Atlas, At Last\" Mission) in the Meridian Metroplex now has a larger activation range.\n  * The first Guardian a player runs into during the \"Beneath the Meridian\" mission is no longer over-leveled.\n  * The Eridian chest by the Grotto in the Jakob's Estate is no longer invisible.\n\n **Balance Updates**\n\n  * Eridium crystals in Voracious Canopy grow less frequently.\n  * The amount of loot drops have been scaled down in Mayhem Mode.\n  * Torgue shotgun sticky damage has been reduced.\n  * E-Tech shotgun elemental damage has been reduced from \"flesh off your bones\" to \"a lot\".\n  * Chupacabratch dropped too much of his hard-earned loot.\n  * Adjusted spawn rate of Loot Tinks in Mansion. They're special again.\n  * Removed pain-sounds from Troy for his boss fight.\n\nHotfixes are applied at the Game Menu when you start the game. To ensure that\nthe hotfix has been applied, go to the in-game menu and see if \"Updates are\navailable\" is showing.\n\nWe know players have enjoyed a lot of our unique items and might be worried\nabout the changes to Mayhem Mode. Mayhem Mode will still greatly increase\nhigher rarity drop rates across all the worlds in Borderlands 3. The changes\nmade in Mayhem Mode today, specifically on Chupacabratch and Loot Tinks, were\nmade to spread some of the glory of loot explosions to the other areas and\nother enemies to hunt. We want Vault Hunters to hunt for unique items across\nall the worlds. That is the core promise of Mayhem Mode. The targeted\nadjustments seek to keep the grind fresh while still retaining an increase to\nunique drops for all parts of the game. We will be closely monitoring the\nchanges to make sure players are still enjoying all the unique gear in the\ngame.\n\nIn between the larger patches that will continue to expand and improve the\ngame—the first one of those coming next week—we're able to make more minor\nadjustments via these hot fixes or 'micropatches' to improve and fine-tune\nyour experience at a quicker pace. We'll continue to roll out these\nincremental improvements while evaluating gameplay data and identifying\nnecessary balance adjustments, and will be keeping record of all patches on\nour site.\n\nWe are hard at work investigating issues that have been reported, including\nperformance concerns and potential major bugs. Hot fixes generally are used to\nmake balance changes and are handled by the design team. Additional reported\nconcerns may affect other teams which may require that changes are made in a\ntrue content patch/title update. Together the Borderlands 3 teams are working\ntirelessly to release various patches or updates as soon as possible, however,\nwe didn't want to wait on balance changes just for the sake of appearances.\n\nWe are aware that the above list of changes may not include all concerns that\nsome players have reported experiencing, as detailed in the [Borderlands 3\nTroubleshooting and Optimization Guide](https://borderlands.com/en-US/news/2019-09-18-borderlands-3-troubleshooting-optimization-guide/). Thank\nyou for your continued support.\n\n"}